{
    "1": " (1) This Act may be cited as the Code of Civil \nProcedure, 1908. \n(2) It shall come into force on the first day of Januar y, 1909.  ",
    "2": "—In this Act, unless there is anything repugnant in  the subject or context,—  \n       ( 1) “Code” includes rules; \n(2) “decree” means the formal expression of an adjudi cation which, so far as regards the Court \nexpressing it, conclusively determines the rights o f the parties with regard to all or any of the matt ers in \ncontroversy in the suit and may be either prelimina ry or final. It shall be deemed to include the reje ction \nof a plaint and the determination of any question w ithin 2*** section 144, but shall not include—  \n(a) any adjudication from which an appeal lies as an appeal from an order, or \n(b) any order of dismissal for default. \nExplanation.— A decree is preliminary when further proceedings have  to be taken before the suit \ncan be completely disposed of. It is final when suc h adjudication completely disposes of the suit.       \nIt may be partly preliminary and partly final;  \n(3) “decree-holder” means any person in whose favour a decree has been passed or an order \ncapable of execution has been made; \n(4) “district” means the local limits of the jurisdicti on of a principal Civil Court of original \njurisdiction (hereinafter called a “District Court” ), and includes the local limits of the ordinary \noriginal civil jurisdiction of a High Court;  \n3[( 5) “foreign Court” means a Court situate outside Ind ia and not established or continued by the \nauthority of the Central Government;] \n(6) “foreign judgment” means the judgment of a foreig n Court; \n(7) “Government  Pleader” includes any officer appointed by the Stat e Government to perform all \nor any of the functions expressly imposed by this C ode on the Government Pleader and also any \npleader acting under the directions of the Governme nt Pleader; \n4[(7A) “High Court” in relation to the Andaman and Nicob ar Islands, means the High Court in \nCalcutta; \n(7B) “India”, except in sections 1, 29, 43, 44, 5[44A,] 78, 79, 82, 83 and 87A, means the territory \nof India excluding the State of Jammu and Kashmir;]  \n(8) “Judge” means the presiding officer of a Civil Co urt; 10 (9)  “judgment” means the statement given by the Judge o f the grounds of a decree or order;  \n(10 ) “judgment-debtor” means any person against whom a d ecree has been passed or an order capable \nof execution has been made;  \n(11 ) “legal representative” means a person who in law re presents the estate of a deceased person, and \nincludes any person who intermeddles with the estat e of the deceased and where a party sues or is sued  in \na representative character the person on whom the e state devolves on the death of the party so suing o r \nsuied;  \n(12 ) “mesne profits” of property means those profits whi ch the person in wrongful possession of such \nproperty actually received or might with ordinary d iligence have received therefrom, together with \ninterest on such profits, but shall not include pro fits due to improvements made by the person in wron gful \npossession;  \n(13 ) “movable property” includes growing crops;  \n(14 ) “order” means the formal expression of any decision  of a Civil Court which is not a decree;  \n(15 ) “pleader” means any person entitled to appear and p lead for another in Court, and includes an \nadvocate, a vakil and an attorney of a High Court;  \n(16 ) “prescribed” means prescribed by rules;  \n(17 ) “public officer” means a person falling under any  of the following descriptions, namely :—  \n(a) every Judge; \n(b) every member of  1[an All-India Service]; \n(c) every commissioned or gazetted officer in the mil itary 2[naval or air] forces of. 3[the Union] \n4*** while serving under the Government; \n(d) Every officer of a court of Justice whose duty it  is, as such officer, to investigate or report on \nany matter of law or fact, or to make, authenticate  or keep any document, or to take charge or dispose  \nof any property, or to execute any judicial process , or to administer any oath, or to interpret, or to  \npreserve order, in the Court, and every person espe cially authorised by a court of Justice to perform \nany of such duties; \n(e) every person who holds any office by virtue of wh ich he is empowered to place or keep any \nperson in confinement; \n(f) every officer of the Government whose duty it is,  as such officer, to prevent offences, to give \ninformation of offences, to bring offenders to just ice, or to protect the public health, safety or \nconvenience; \n(g) every officer whose duty it is, as such officer, to take, receive, keep or expend any property on \nbehalf of the Government, or to make any survey, as sessment or contract on behalf of the \nGovernment, or to execute any revenue process, or t o investigate, or to report on, any matter affectin g \nthe pecuniary interests of the Government, or to ma ke, authenticate or keep any document relating to \nthe pecuniary interests of the Government, or to pr event the infraction of any law for the protection of \nthe pecuniary interests of the Government; and \n(h) every officer in the service or pay of the Govern ment, or remunerated by fees or commission \nfor the performance of any public duty; \n(18 ) “rules” means rules and forms contained in the Firs t Schedule or made under section 122 or \nsection 125;  \n(19 ) “share in a corporation” shall be deemed to include  stock, debenture stock, debentures or bonds; \nand  \n(20 ) “signed”, save in the case of a judgment or decree,  includes stamped. \n                                                      \n1. Subs. by Act 104 of 1976, s. 3, for “the Indian Civil Service” (w.e.f. 1-2-1977).  \n2. Subs. by Act 35 of 1934, s. 2 and the Schedule, for “or naval”. \n3. Subs. by the A.O. 1950, for “his Majesty”. \n4. The words “including His Majesty’s Indian Marine  Service” omitted by Act 35 of 1934, s. 2 and the S chedule.  ",
    "3": " For  the purposes of this Code, the District Court is su bordinate to the \nHigh Court, and every Civil Court of a grade inferi or to that of a District Court and every Court of S mall \nCauses is subordinate to the High Court and Distric t Court.  \n",
    "4": " (1) In the absence of any specific provision to the Con trary, nothing in this Code shall \nbe deemed to limit or otherwise affect any special or local law now in force or any special jurisdicti on or \npower conferred, or any special form of procedure p rescribed, by or under any other law for the time \nbeing in force.  \n(2) In particular and without prejudice to the generality of the proposition contained in sub-sect ion  (1), \nnothing in this Code shall be deemed to limit or ot herwise affect any remedy which a landholder or \nlandlord may have under any law for the time being in force for the recovery of rent of agricultural l and \nfrom the produce of such land.  \n",
    "5": " (1) Where any Revenue Courts are governed by \nthe provisions of this Code in those matters of pro cedure upon which any special enactment applicable to \nthem is silent, the State Government 2*** may, by notification in the Official Gazette, d eclare that any \nportions of those provisions which are not expressl y made applicable by this Code shall not apply to t hose \nCourts, or shall only apply to them with such modif ications as the State Government 3* * * may prescribe. \n(2) “Revenue Court” in sub-section ( 1) means a Court having jurisdiction under any local l aw to \nentertain suits or other proceedings relating to th e rent, revenue or profits of land used for \nagricultural purposes, but does not include a Civil  Court having original jurisdiction under this Code  \nto try such suits or proceedings as being suits or proceedings of a civil nature. \n",
    "6": " Save  in so far as is otherwise expressly provided, nothi ng herein \ncontained shall operate to give any Court jurisdict ion over suits the amount or value of the subject-m atter \nof which exceeds the pecuniary limits (if any) of i ts ordinary jurisdiction. \n",
    "7": " The  following provisions shall not extend to Courts \nconstituted under the Provincial Small Cause Courts  Act, 1887(9 of 1887) 4[or under the Berar Small \nCause Courts Law, 1905], or to Courts exercising th e jurisdiction of a Court of Small Causes 5[under the \nsaid Act or Law], 6[or to Courts in 7[any part of India to which the said Act does not e xtend] exercising a \ncorresponding jurisdiction that is to say.—  \n(a) so much of the body of the Code as relates to—  \n(i) suits excepted from the cognizance of a Court of Small Causes; \n(ii ) the execution of decrees in such suits; \n(iii ) the execution of decrees against immovable proper ty; and \n(b) the following sections, that is to say,—  \nsection 9, \nsections 91 and 92, \nsections 94 and 95 8[so far as they authorize or relate to]— \n (i) orders for the attachment of immovable property, \n(ii ) injunctions, \n(iii ) the appointment of a receiver of immovable proper ty, or ",
    "8": " Save  as provided in sections 24, 38 to 41, 75, clauses ( a), (b) \nand (c) , 76, 1[77, 157 and 158], and by the Presidency Small Caus e Courts Act, 1882 (15 of 1882), the \nprovisions in the body of this Code shall not exten d to any suit or proceeding in any Court of Small \nCauses established in the towns of Calcutta, Madras  and Bombay :  \n2[Provided that—  \n(1) the High Courts of Judicature at Fort William, Ma dras and Bombay, as the case may be, may \nfrom time to time, by notification in the Official Gazette, direct 3 that any such provisions not \ninconsistent with the express provisions of the Pre sidency Small Cause Courts Act, 1882 (15 of 1882), \nand with such modifications and adaptations as may be specified in the notification, shall extend to s uits \nor proceedings or any class of suits or proceedings  in such Court. \n(2) All rules heretofore made by any of the said High  Courts under section 9 of the Presidency \nSmall Cause Courts Act, 1882 (15 of 1882) shall be deemed to have been validly made.] \nPART I \nSUITS IN GENERAL \nJURISDICTION OF THE COURTS  AND Res Judicata  \n",
    "9": " The  Courts shall (subject to the provisions herein \ncontained) have jurisdiction to try all suits of a civil nature excepting suits of which their cogniza nce is \neither expressly or impliedly barred. \n4[Explanation I].— A suit in which the right to property or to an office  is contested is a suit of a civil \nnature, notwithstanding that such right may depend entirely on the decision of questions as to religio us \nrites or ceremonies.  \n5[Explanation I].— For  the purposes of this section, it is immaterial whet her or not any fees are attached \nto the office referred to in Explanation I or whether or not such office is attached to a part icular place.]  \n",
    "10": " No  Court shall proceed with the trial of any suit in w hich the matter in issue is also \ndirectly and substantially in issue in a previously  instituted suit between the same parties, or betwe en \nparties under whom they or any of them claim litiga ting under the same title where such suit is pendin g in \nthe same or any other Court in 6[India] have jurisdiction to grant the relief claim ed, or in any Court \nbeyond the limits of 6[India] established or continued by 7[the Central Government 8***.] and having like \njurisdiction, or before 9[the Supreme Court].  \nExplanation.— The pendency of a suit in a foreign Court does not preclude the Courts in 6[India] from \ntrying a suit founded on the same cause of action.  \n11 . Res  judicata.— No  Court shall try any suit or issue in which the matt er directly and substantially \nin issue has been directly and substantially in iss ue in a former suit between the same parties, or be tween \nparties under whom they or any of them claim, litig ating under the same title, in a Court competent to  try \nsuch subsequent suit or the suit in which such issu e has been subsequently raised, and has been heard and \nfinally decided by such Court.  ",
    "11": "",
    "12": "",
    "13": " A foreign judgment shall be conclusive as to any \nmatter thereby directly adjudicated upon between th e same parties or between parties under whom they o r \nany of them claim litigating under the same title e xcept—  \n(a) where it has not been pronounced by a Court of co mpetent jurisdication; \n(b) where it has not been given on the merits of the case; \n(c) where it appears on the face of the proceedings t o be founded on an incorrect view of \ninternational law or a refusal to recognise the law  of 2[India] in cases in which such law is applicable; \n(d) where the proceedings in which the judgment was o btained are opposed to natural justice; \n(e) where it has been obtained by fraud; \n(f) where it sustains a claim founded on a breach of an y law in force in 2[India].  \n",
    "14": " The Court shall presume upon the production of any \ndocument purporting to be a certified copy of a for eign judgment, that such judgment was pronounced by  \na Court of competent jurisdiction, unless the contr ary appears on the record; but such presumption may  be \ndisplaced by proving want of jurisdiction.  \nPLACE  OF  SUING  \n",
    "15": " Every  suit shall be instituted in the Court of the lowest  \ngrade competent to try it.  \n",
    "16": " Subject  to the pecuniary or other \nlimitations presscribed by any law, suits—  \n(a) for the rocovery of immovable property with or wi thout rent or profits, \n(b) for the partition of immovable property, ",
    "17": " Where  a suit is to \nobtain relief respecting, or compensation for wrong  to, immovable property situate within the jurisdic tion of \ndifferent Courts. the suit may be instituted in any  Court within the local limits of whose jurisdictio n any \nportion of the property is situate : \nProvided that, in respect of the value of the subje ct-matter of the suit, the entire claim is cognizab le \nby such Court. \n",
    "18": " (1) Where it is alleged to be uncertain within the loca l limits of the jurisdiction of which of \ntwo or more Courts any immovable property is situat e, any one of those Courts may, if satisfied that t here \nis ground for the alleged uncertainty, record a sta tement to that effect and thereupon proceed to ente rtain \nand dispose of any suit relating to that property, and its decree in the suit shall have the same effe ct as if \nthe property were situate within the local limits o f its jurisdiction: \nProvided that the suit is one with respect to which  the Court is competent as regards the nature and \nvalue of the suit to exercise jurisdiction. \n(2) Where a statement has not been recorded under sub-s ection (1), and an .objection is taken before \nan Appellate or Revisional Court that a decree or o rder in a suit relating to such property was made b y a \nCourt not having jurisdiction where the property is  situate, the Appellate or Revisional Court shall n ot \nallow the objection unless in its opinion there was , at the time of the institution of the suit, no re asonable \nground for uncertainty as to the court having juris diction with respect thereto and there has been a \nconsequent failure of justice. \n",
    "19": " Where  a suit is for compensation for \nwrong done to the person or to movable property, if  the wrong was done within the local limits of the \njurisdiction of one Court and the defendant resides , or carries on business, or personally works for g ain, within \nthe local limits of the jurisdiction of another Cou rt, the suit may be instituted at the option of the  plaintiff in \neither of the said Courts.  \nIllustrations \n \n(a) A, residing in Delhi, beats B in Calcutta. B may su e A either in Calcutta or in Delhi. \n(b) A, residing in Delhi, publishes in Calcutta stateme nts defamatory of B. B may sue A either in Calcutta  or in \nDelhi. \n",
    "20": " Subject  to \nthe limitations aforesaid, every suit shall be inst ituted in a Court within the local limits of whose \njurisdiction—  \n(a) the defendant, or each of the defendants where ther e are more than one, at the time of the \ncommencement of the suit, actually and voluntarily resides, or carries on business, or personally \nworks for gain; or \n(b) any of the defendants, where there are more than on e, at the time of the commencement of the \nsuit, actually and voluntarily resides, or carries on business, or personally works for gain, provided  ",
    "21": " No suit shall lie \nchallenging the validity of a decree passed in a fo rmer suit between the same parties, or between the \nparties under whom they or any of them claim, litig ating under the same title, on any ground based on an \nobjection as to the place of suing.  \nExplanation.— The  expression “former suit” means a suit which has bee n decided prior to the \ndecision in the suit in which the validity of the d ecree is questioned, whether or not the previously \ndecided suit was instituted prior to the suit in wh ich the validity of such decree is questioned.]  \n",
    "22": " Where  a suit may \nbe instituted in any one of two or more Courts and is instituted in one of such Courts, any defendant,  after \nnotice to the other parties, may, at the earliest p ossible opportunity and in all cases where issues a re \nsettled at or before such settlement, apply to have  the suit transferred to another Court, and the Cou rt to \nwhich such application is made, after considering t he objections of the other parties (if any), shall \ndetermine in which of the several Courts having jur isdiction the suit shall proceed.  ",
    "23": " (I) Where the several Courts having jurisdiction are subordinate \nto the same Appellate Court, an application under s ection 22 shall be made to the Appellate Court. \n(2) Where such Courts are subordinate to different Ap pellate Courts but to the same High Court, the \napplication shall be made to the said High Court. \n(3) Where such Courts are subordinate to different Hi gh Courts, the application shall be made to the \nHigh Court within the local limits of whose jurisdi ction the Court in which the suit is brought is sit uate. \n",
    "24": " (1 ) On the application of any of the parties and \nafter notice to the parties and after hearing such of them as desired to be heard, or of its own motio n \nwithout such notice, the High Court or the District  Court may at any stage—  \n (a) transfer any suit, appeal or other proceeding pen ding before it for trial or disposal to any \nCourt subordinate to it and competent to try or dis pose of the same, or \n(b) withdraw any suit,  appeal or other proceeding pending in any Court sub ordinate to it, and—  \n(i) try or dispose of the same; or \n(ii ) transfer the same for trial or disposal to any Co urt subordinate to it and competent to \ntry or dispose of the same; or \n(iii ) retransfer the same for trial or disposal to the Court from which it was withdrawn. \n(2) Where any suit or proceeding has been transferred o r withdrawn under sub-section ( 1), the Court \nwhich 1[is thereafter to try or dispose of such suit or pr oceeding] may, subject to any special directions in  the \ncase of an order of transfer, either retry it or pr oceed from the point at which it was transferred or  \nwithdrawn. \n2[(3) For the purposes of this section,—  \n(a) Courts of Additional and Assistant Judges shall b e deemed to be subordinate to the \nDistrict Court; \n(b) “proceeding” includes a proceeding for the execut ion of a decree or order.] \n(4) The Court trying any suit transferred or withdraw n under this section from a Court of Small \nCauses shall, for the purposes of such suit, be dee med to be a Court of Small Causes. \n3[(5)  A suit or proceeding may be transferred under this section from a Court which has no \njurisdiction to try it.]  \n4[",
    "25": "(1) On the application of a party, and after notice \nto the parties, and after hearing such of them as d esire to be heard, the Supreme Court may, at any st age, if \nsatisfied that an order under this section is exped ient for the ends of justice, direct that any suit,  appeal or other \nproceeding be transferred from a High Court or othe r Civil Court in one State to a High Court or other  Civil \nCourt in an other State. \n(2) Every application under this section shall be mad e by a motion which shall be supported by an \naffidavit. \n(3) The Court to which such suit, appeal or other pro ceeding is transferred shall, subject to any specia l \ndirections in the order of transfer, either retry i t or proceed from the stage at which it was transfe rred to it. \n(4) In dismissing any application under this section,  the Supreme Court may, if it is of opinion that \nthe application was frivolous or vexatious, order t he applicant to pay by way of compensation to any \nperson who has opposed the application such sum, no t exceeding two thousand rupees, as it considers \nappropriate in the circumstances of the case. \n(5) The law applicable to any suit, appeal or other p roceeding transferred under this section shall be \nthe law which the Court in which the suit, appeal o r other proceeding was originally instituted ought to \nhave applied to such suit, appeal or proceeding.] ",
    "26": "",
    "27": " Where  a suit has been duly instituted, a summons may be i ssued to \nthe defendant to appear and answer the claim and ma y be served in manner prescribed 2[on such day not \nbeyond thirty days from date of the institution of the suit.] \n",
    "28": " (1) A summons may be sent for \nservice in another State to such Court and in such manner as may be prescribed by rules in force in th at State.  \n(2) The Court to which such summons is sent shall, upon  receipt thereof, proceed as if it had been \nissued by such Court and shall then return the summ ons to the Court of issue together with the record       \n(if any) of its proceedings with regard thereto. \n4[( 3) Where the language of the summons sent for servic e in another State is different from the \nlanguage of the record referred to in sub-section ( 2), a translation of the record,—  \n(a) in Hindi, where the language of the Court issuing  the summons is Hindi, or \n(b) in Hindi or English where the language of such re cord is other than Hindi or English, \nshall also be sent together with the record sent un der that sub-section.] \n5[",
    "29": " Summonses  and other processes issued by—  \n(a) any Civil or Revenue Court established in any par t of India to which the provisions of this \nCode do not extend, or \n(b) any Civil or Revenue Court established or continu ed by the authority of the Central \nGovernment outside India, or \n(c) any other Civil or Revenue Court outside India to  which the Central Government has, by \nnotification in the Official Gazette, declared the provisions of this section to apply, \nmay be sent to the Courts in the territories to whi ch this Code extends, and served as if they were \nsummonses issued by such Courts.] \n",
    "30": " Subject  to such conditions and limitations as may be \nprescribed, the Court may, at any time, either of i ts own motion or on the application of any party,—  \n(a) make such orders as may be necessary or reasonabl e in all matters relating to the delivery and \nanswering of interrogatories, the admission of docu ments and facts, and the discovery, inspection, \nproduction, impounding and return of documents or o ther material objects producible as evidence; \n(b) issue summonses to persons whose attendance is re quired either to give evidence or to \nproduce documents or such other objects as aforesai d; \n(c) order any fact to be proved by affidavit. \n",
    "31": " The  provisions in sections 27, 28 and 29 shall apply to  summonses to give \nevidence or to produce documents or other material objects.   \n",
    "32": " The  Court may compel the attendance of any person to wh om a summons \nhas been issued under section 30 and for that purpo se may—  \n(a) issue a warrant for his arrest; \n(b) attach and sell his property; ",
    "33": " The  Court, after the case has been heard, shall pronoun ce judgment, and on \nsuch judgment a decree shall follow.  \nINTEREST  \n",
    "34": " (1) Where and in so far as a decree is for the paymen t of money, the Court may, in the decree, \norder interest at such rate as the Court deems reas onable to be paid on the principal sum adjudged, fr om the date of \nthe suit to the date of the decree, in addition to any interest adjudged on such principal sum for any  period prior to \nthe institution of the suit, 2[with further interest at such rate not exceeding s ix per cent. per annum as the Court \ndeems reasonable on such principal sum], from the d ate of the decree to the date of payment, or to suc h earlier date \nas the Court thinks fit :  \n3[Provided that where the liability in relation to t he sum so adjudged had arisen out of a commercial \ntransaction, the rate of such further interest may exceed six per cent. per annum, but shall not excee d the \ncontractual rate of interest or where there is no c ontractual rate, the rate at which moneys are lent or advanced \nby nationalised banks in relation to commercial tra nsactions. \nExplanation I.—In this Sub-section, “nationalised bank” means a  corresponding new bank as defined in \nthe Banking Companies (Acquisition and Transfer of Undertakings) Act, 1970 (5 of 1970).  \nExplanation II.—For the purposes of this section, a transaction  is a commercial transaction, if it is \nconnected with the industry, trade or business of t he party incurring the liability.]  \n(2) Where such a decree is silent with respect to the p ayment of further interest 2[on such principal sum] \nfrom the date of the decree to the date of payment or other earlier date, the Court shall be deemed to  have \nrefused such interest, and a separate suit therefor  shall not lie.  \nCOSTS  \n",
    "35": "—(1) Subject to such conditions and limitations as may b e prescribed, and to the provisions of any \nlaw for the time being in force, the costs of and i ncident to all suits shall be in the discretion of the Court, and the \nCourt shall have full power to determine by whom or  out of what property and to what extent such costs  are to be \npaid, and to give all necessary directions for the purposes aforesaid. The fact that the Court has no jurisdiction to \ntry the suit shall be no bar to the exercise of suc h powers.  \n(2) Where the Court directs that any costs shall not fo llow the event, the Court shall state its reasons i n \nwriting. \n4*   *   *   *   * \n5[35. Costs.—  (1) In relation to any commercial dispute, the Court,  notwithstanding anything contained in \nany other law for the time being in force or Rule, has the discretion to determine:  \n(a) whether costs are payable by one party to another ; \n(b) the quantum of those costs; and \n(c) when they are to be paid. \nExplanation .—For the purpose of clause ( a), the expression “costs” shall mean reasonable cos ts \nrelating to— \n(i) the fees and expenses of the witnesses incurred; \n(ii ) legal fees and expenses incurred; \n(iii ) any other expenses incurred in connection with th e proceedings. \n(2) If the Court decides to make an order for payment  of costs, the general rule is that the unsuccessfu l \nparty shall be ordered to pay the costs of the succ essful party:  19 Provided that the Court may make an order deviating  from the general rule for reasons to be recorded i n \nwriting. \nIllustration \n The Plaintiff, in his suit, seeks a money decree f or breach of contract, and damages. The Court holds  that the \nPlaintiff is entitled to the money decree. However,  it returns a finding that the claim for damages is  frivolous and \nvexatious. \nIn such circumstances the Court may impose costs on  the Plaintiff, despite the Plaintiff being the suc cessful \nparty, for having raised frivolous claims for damag es.  \n(3) In making an order for the payment of costs, the Court shall have regard to the following circumstan ces, \nincluding— \n(a) the conduct of the parties; \n(b) whether a party has succeeded on part of its case , even if that party has not been wholly successful ; \n(c) whether the party had made a frivolous countercla im leading to delay in the disposal of the case; \n(d) whether any reasonable offer to settle is made by  a party and unreasonably refused by the other part y; \nand  \n(e) whether the party had made a frivolous claim and instituted a vexatious proceeding wasting the time of \nthe Court. \n(4) The orders which the Court may make under this pr ovision include an order that a party must pay––  \n(a) a proportion of another party’s costs;  \n(b) a stated amount in respect of another party’s cos ts;  \n(c) costs from or until a certain date;  \n(d) costs incurred before proceedings have begun;  \n(e) costs relating to particular steps taken in the p roceedings; \n(f) costs relating to a distinct part of the proceedi ngs; and \n ( g) interest on costs from or until a certain date.]  \n1[35A. Compensatory costs in respect of false or vex atious claims or defences.— (1) If in any suit \nor other proceedings 2[including an execution proceeding but 3[excluding an appeal or a revision] any \nparty objects to the claim or defence on the ground  that the claim or defence or any part of it is, as  against \nthe objector, false or vexatious to the knowledge o f the party by whom it has been put forward, and if  \nthereafter, as against the objector, such claim or defence is disallowed, abandoned or withdrawn in wh ole \nor in part, the Court, 4[if it so thinks fit], may, after recording its rea sons for holding such claim or \ndefence to be false or vexatious, make an order for  the payment to the object or by the party by whom \nsuch claim or defence has been put forward, of cost  by way of compensation. \n5[(2) No Court shall make any such order for the paymen t of an amount exceeding 6[three thousand \nrupees] or exceeding the limits of its pecuniary ju risdiction, whichever amount is less: \nProvided that where the pecuniary limits of the jur isdiction of any Court excercising the jurisdiction  of a \nCourt of Small Causes under the Provincial Small Ca use Courts Act, 1887 (9 of 1887), 7[or under a \ncorresponding law in force in 8[any part of India to which the said Act does not e xtend]] and not being a Court \nconstituted  9[under such Act or law], are less than two hundred and fifty rupees, the High Court may empower \nsuch Court to award as costs under this section any  amount not exceeding two hundred and fifty rupees and \nnot exceeding those limits by more than one hundred  rupees : \nProvided, further, that the High Court may limit th e amount which any Court or class of Courts is \nempowered to award as costs under this section.] \n                                                      \n1. S. 35A ins. by Act 9 of 1922, s. 2, which, under  section 1( 2) thereof may be brought into force in any State by  the State \nGovernment on any specified date. It has been so br ought into force in Bombay, Bengal, U.P., Punjab, Biha r, C.P., Assam, \nOrissa and Madras.   \n2. Subs. by Act 66 of 1956, s. 4, for “not being an  appeal”. \n3. Subs. by Act 104 of 1976, s. 14, for “excluding an appeal” (w.e.f. 1-2-1977). \n4. Subs. by Act 66 of 1956, s. 4, for certain words . \n5. Shall not be applicable to commercial disputes o f a specified value by Act 4 of 2016, s. 16 and the  Schedule (w.e.f. 23-10-\n2015). \n6. Subs. by Act 104 of 1976, s. 14, for “one thousa nd rupees” (w.e.f. 1-2-1977). \n7. Ins. by Act 2 of 1951, s. 7. \n8. Subs. by the Adaptation of Laws (No. 2) Order, 1 956, for “a Part B State”.  \n9. Subs. by Act 2 of 1951, s. 7, for “under that Ac t”. \n ",
    "36": " The  provisions of this Code relating to the execution o f decrees \n(including provisions relating to payment under a d ecree) shall, so far as they are applicable, be dee med \nto apply to the execution of orders (including paym ent under an order).] \n",
    "37": " The  expression “Court which passed a decree,” \nor words to that effect, shall, in relation to the execution of decrees, unless there is anything repu gnant in \nthe subject or context, be deemed to include,—  \n (a) where the decree to be executed has been passed i n the exercise of appellate jurisdiction, the \nCourt of first instance, and \n(b) where the Court of first instance has ceased to e xist or to have jurisdiction to execute it, the \nCourt which, if the suit wherein the decree was pas sed was instituted at the time of making the \napplication for the execution of the decree, would have jurisdiction to try such suit. \n3[Explanation.— The  Court of first instance does not cease to have juri sdiction to execute a decree \nmerely on the ground that after the institution of the suit wherein the decree was passed or after the  passing \nof the decree, any area has been transferred from t he jurisdiction of that Court to the jurisdiction o f any other \nCourt; but, in every such case, such other Court sh all also have jurisdiction to execute the decree, i f at the \ntime of making the application for execution of the  decree it would have jurisdiction to try the said suit.] \n \nCOURTS  BY WHICH DECREES MAY BE EXECUTED \n",
    "38": " A decree may be executed either by the Court which \npassed it, or by the Court to which it is sent for execution.  \n",
    "39": " (1) The Court which passed a decree may, on the appli cation of the decree-\nholder, send it for execution to another Court 4[of competent jurisdiction],—  ",
    "40": " Where  a decree is sent for execution in another State, it  \nshall be sent to such Court and executed in such ma nner as may be prescribed by rules in force in that  State.  \n",
    "41": "The  Court to which a decree is sent for \nexecution shall certify to the Court which passed i t the fact of such execution, or where the former C ourt \nfails to execute the same the circumstances attendi ng such failure.  \n",
    "42": "— 3[(1)] The  Court executing a decree sent to it shall \nhave the same powers in executing such decree as if  it had been passed by itself. All persons is disob eying          \nor obstructing the execution of the decree shall be  punishable by such Court in the same manner as if it had \npassed the decree. And its order in executing such decree shall be subject to the same rules in respec t of \nappeal as if the decree had passed by itself. \n4[( 2) Without prejudice to the generality of the provisio ns of sub-section ( 1), the powers of the Court \nunder that sub-section shall include the following powers of the Court which passed the decree, namely :—  \n(a) power to send the decree for execution to another  Court under section 39; \n(b) power to execute the decree against the legal rep resentative of the deceased judgment-debtor \nunder section 50; \n(c) power to order attachment of a decree. \n(3) A Court passing an order in exercise of the power s specified in sub-section ( 2) shall send a copy \nthereof to the Court which passed the decree. \n(4) Nothing in this section shall be deemed to confer  on the Court to which a decree is sent for \nexecution any of the following powers, namely:—  \n(a) power to order execution at the instance of the t ransferee of the decree ; \n(b) in the case of a decree passed against a firm, po wer to grant leave to execute such decree \nagainst any person, other than such a person as is referred to in clause ( b), or clause ( c), of              \nsub-rule ( 1) of rule 50 of Order XXI. ] \n5[",
    "43": "\nAny  decree passed by any Civil Court established in any  part of India to which the provisions of this Code  do \nnot extend, or by any Court established or continue d by the authority of the Central Government outsid e India, \nmay, if it cannot be executed within the jurisdicti on of the Court by which it was passed, be executed  in the \nmanner herein provided within the jurisdiction of a ny Court in the territories to which this Code exte nds.]  ",
    "44": " The State Government may, by notification in the Of ficial Gazette, declare that the decrees of \nany Revenue Court in any part of India to which the  provisions of this Code do not extend, or any clas s of \nsuch decrees, may be executed in the State as if th ey had been passed by Courts in that State.]  \n2[44A. Execution of decrees passed by Courts in reci procating territory.— (1) Where a certified \ncopy of a decree of any of the superior Courts of 3*** any reciprocating territory has been filed in a  \nDistrict Court, the decree may be executed in 4[India] as if it had been passed by the District Co urt.  \n(2) Together with the certified copy of the decree sh all be filed a certificate from such superior Court  \nstating the extent, if any, to which the decree has  been satisfied or adjusted and such certificate sh all, for the \npurposes of proceedings under this section, be conc lusive proof of the extent of such satisfaction or \nadjustment. \n(3) The provisions of section 47 shall as from the fi ling of the certified copy of the decree apply to t he \nproceedings of a District Court executing a decree under this section, and the District Court shall re fuse \nexecution of any such decree, if it is shown to the  satisfaction of the Court that the decree falls wi thin any \nof the exceptions specified in clauses ( a) to ( f) of section 13. \n5[Explanation 1.—  “Reciprocating  territory” means any country or territory outside I ndia which the \nCentral Government may, by notification in the Offi cial Gazette, declare to be a reciprocating territo ry for \nthe purposes of this section; and “superior Courts” , with reference to any such territory, means such \nCourts as may be specified in the said notification .  \nExplanation 2.— “Decree” with reference to a superior Court mea ns any decree or judgment of such \nCourt under which a sum of money is payable, not be ing a sum payable in respect of taxes or other \ncharges of a like nature or in respect of a fine or  other penalty, but shall in no case include an arb itration \naward, even if such an award is enforceable as a de cree or judgment.]]  \n6[",
    "45": " So  much of the foregoing sections of this Part as \nempowers a Court to send a decree for execution to another Court shall be construed as empowering a \nCourt in any State to send a decree for execution t o any Court established 7*** by the authority of the \nCentral Government 8[outside India] to which the State Government has b y notification in the Official \nGazette declared this section to apply.]  \n",
    "46": " (1) Upon the application of the decree-holder the Court  which passed the decree may. \nwhenever it thinks fit, issue a precept to any othe r Court which would be competent to execute such \ndecree to attach any property belonging to the judg ment-debtor and specified in the precept.  \n(2) The Court to which a precept is sent shall proceed to attach the property in the manner prescribed \nin regard to the attachment of property in executio n of a decree:  \nProvided that no attachment under a precept shall c ontinue for more than two months unless the \nperiod of attachment is extended by an order of the  Court which passed the decree or unless before the  \ndetermination of such attachment the decree has bee n transferred to the Court by which the attachment \nhas been made and the decree-holder has applied for  an order for the sale of such property. \nQUESTIONS TO BE DETERMINED BY COURT EXECUTING DECREE  \n",
    "47": " (1) All questions arising between \nthe parties to the suit in which the decree was pas sed, or their representatives, and relating to the \nexecution, discharge or satisfaction of the decree,  shall be determined by the Court executing the dec ree \nand not by a separate suit.  ",
    "48": "",
    "49": " Every  transferee of a decree shall hold the same subject to the equities (if any) which \nthe judgment-debtor might have enforced against the  original decree-holder.  \n",
    "50": " (1) Where a judgment-debtor dies before the decree has been fully satisfied, \nthe holder of the decree may apply to the Court whi ch passed it to execute the same against the legal \nrepresentative of the deceased.  \n(2) Where the decree is executed against such legal rep resentative, he shall be liable only to the extent of \nthe property of the deceased which has come to his hands and has not been duly disposed of; and, for t he \npurpose of ascertaining such liability, the Court e xecuting the decree may, of its own motion or on th e \napplication of the decree-holder, compel such legal  representative to produce such accounts as it thin ks \nfit. \nPROCEDURE IN EXECUTION \n",
    "51": " Subject  to such conditions and limitations as may be \nprescribed, the Court may, on the application of th e decree-holder, order execution of the decree—  \n(a) by delivery of any property specifically decreed;  \n(b) by attachment and sale or by the sale without att achment of any property; \n(c) by arrest and detention in prison 3[for such period not exceeding the period specified  in section 58, \nwhere arrest and detention is permissible under tha t section]; \n(d) by appointing a receiver; or \n(e) in such other manner as the nature of the relief granted may require : \n4[Provided that, where the decree is for the payment  of money, execution by detention in prison shall n ot \nbe ordered unless, after giving the judgment-debtor  an opportunity of showing cause why he should not be \ncommitted to prison, the Court, for reasons recorde d in writing, is satisfied—  \n(a) that the judgment-debtor, with the object or effe ct of obstructing or delaying the execution of the \ndecree,—  \n(i) is likely to abscond or leave the local limits of  the jurisdiction of the Court, or  \n(ii ) has, after the institution of the suit in which t he decree was passed, dishonestly transferred, \nconcealed, or removed any part of his property, or committed any other act of bad faith in relation to  \nhis property, or  ",
    "52": " (1) Where a decree is passed against a party \nas the legal representative of a deceased person, a nd the decree is for the payment of money out of th e property \nof the deceased, it may be executed by the attachme nt and sale of any such property.  \n(2) Where no such property remains in the possession of  the judgment-debtor and he fails to satisfy the Co urt \nthat he has duly applied such property of the decea sed as is proved to have come into his possession, the decree \nmay be executed against the judgment-debtor to the extent of the property in respect of which he has f ailed so to \nsatisfy the Court in the same manner as if the decr ee had been against him personally.  \n",
    "53": " For  the purposes of section 50 and section 52, property  in the hands \nof a son or other descendant which is liable under Hindu law for the payment of the debt of a deceased  \nancestor, in respect of which a decree has been pas sed, shall be deemed to be property of the deceased  which \nhas come to the hands of the son or other descendan t as his legal representative.  \n",
    "54": " Where  the decree is for the partition of an undivided est ate \nassessed to the payment of revenue to the Governmen t, or for the separate possession of a share of suc h an estate, \nthe partition of the estate or the separation of th e share shall be made by the Collector or any gazet ted subordinate \nof the Collector  deputed by him in this behalf, in  accordance with the law (if any) for the time bein g in force \nrelating to the partition, or the separate possessi on of shares, of such estates.  \nARREST AND DETENTION \n55 . Arrest and detention. —(1) A judgment-debtor may be arrested in execution of  a decree at, any \nhour and on any day, and shall, as soon as practica ble, be brought before the Court, and his detention  may \nbe in the civil prison of the district in which the  Court ordering the detention is situate, or, where  such \ncivil prison does not afford suitable accommodation , in any other place which the State Government may  \nappoint for the detention of persons ordered by the  Courts of such district to be detained: \nProvided, firstly that, for the purpose of making a n arrest under this section, no dwelling-house shal l be \nentered after sunset and before sunrise: \nProvided, secondly, that no outer door of a dwellin g-house shall be broken open unless such dwelling-\nhouse is in the occupancy of the judgment-debtor an d he refuses or in any way prevents access thereto,  but \nwhen the officer authorized to make the arrest has duly gained access to any dwelling-house, he may br eak \nopen the door of any room in which he has reason to  believe the judgment-debtor is to be found: \nProvided, thirdly that, if the room is in the actua l occupancy of a woman who is not the judgment-debt or \nand who according to the customs of the country doe s not appear in public, the officer authorized to m ake the \narrest shall give notice to her that she is at libe rty to withdraw, and, after allowing a reasonable t ime for her to \nwithdraw and giving her reasonable facility for wit hdrawing, may enter the room for the purpose of mak ing \nthe arrest: \nProvided, fourthly, that, where the decree in execu tion of which a judgment-debtor is arrested, is a \ndecree for the payment of money and the judgment-de btor pays the amount of the decree and the costs of  \nthe arrest to the officer arresting him, such offic er shall at once release him. \n(2) The State Government may, by notification in the Official Gazette, declare that any person or class of \npersons whose arrest might be attended with danger or inconvenience to the public shall not be liable to arrest \nin execution of a decree otherwise than in accordan ce with such procedure as may be prescribed by the State \nGovernment in this behalf.",
    "55": "",
    "56": " Notwithstanding  \nanything in this Part, the Court shall not order th e arrest or detention in the civil prison of a woma n in \nexecution of a decree for the payment of money.  \n",
    "57": " The  State Government may fix scales, graduated accordin g to rank, \nrace and nationality, of monthly allowances payable  for the subsistence of judgment-debtors.  \n",
    "58": " (1) Every person detained in the civil prison in execut ion of a decree \nshall be so detained,—  \n(a) where the decree is for the payment of a sum of mon ey exceeding 3[4[five thousand rupees], \nfor a period not exceeding three months, and,]  \n5[( b) where the decree is for the payment of a sum of mon ey exceeding two thousand rupees, \nbut not exceeding five thousand rupees, for a perio d not exceeding six weeks.] \n6(1A) For the removal of doubts, it is hereby declared th at no order for detention of the judgment-\ndebtor in civil prison in execution of a decree for  the payment of money shall be made, where the tota l \namount of the decree does not exceed 7[two thousand rupees.]  \n(2) A judgment-debtor released from detention under thi s section shall not merely by reason of his \nrelease be discharged from his debt, but he shall n ot be liable to be re-arrested under the decree in \nexecution of which he was detained in the civil pri son.  \n",
    "59": " (1) At any time after a warrant for the arrest of a j udgment-debtor \nhas been issued the Court may cancel it on the grou nd of his serious illness.  \n(2) Where a judgment-debtor has been arrested, the Cour t may release him if, in its opinion, he is not \nin a fit state of health to be detained in the civi l prison.  \n(3) Where a judgment-debtor has been committed to the c ivil prison, he may be released therefrom—  \n(a) by the State Government, on the ground of the exi stence of any infectious or contagious \ndisease, or \n(b) by the committing Court, or any Court to which th at Court is subordinate, on the ground of his \nsuffering from any serious illness. \n(4) A judgment-debtor released under this section may b e re-arrested, but the period of his detention \nin civil prison shall not in the aggregate exceed t hat prescribed by section 58.  \n \nATTACHMENT  \n8",
    "60": "—(1) The following property is \nliable to attachment and sale in execution of a dec ree, namely, lands, houses or other buildings, good s, \nmoney, bank-notes, cheques, bills of exchange, hund is, promissory notes, Government securities, bonds  or 26 other securities for money, debts, shares in a corp oration and, save as hereinafter mentioned, all oth er \nsaleable property, movable or immovable, belonging to the judgment-debtor, or over which, or the profi ts \nof which, he has a disposing power which he may exe rcise for his own benefit, whether the same be held  \nin the name of the judgment-debtor or by another pe rson in trust for him or on his behalf: \nProvided that the following particulars shall not b e liable to such attachment or sale, namely:—  \n(a) the necessary wearing-apparel, cooking vessels, b eds and bedding of the judgment-debtor, his \nwife and children, and such personal ornaments as, in accordance with religious usage, cannot be \nparted with by any woman; \n(b) tools of artisans, and, where the judgment-debtor  is an agriculturist, his implements of \nhusbandry and such cattle and seed-grain as may, in  the opinion of the Court, be necessary to enable \nhim to earn his livelihood as such, and such portio n of agricultural produce or of any class of \nagricultural produce as may have been declared to b e free from liability under the provisions of the \nnext following section; \n(c) houses and other buildings (with the materials an d the sites thereof and the land immediately \nappurtenant thereto and necessary for their enjoyme nt) belonging to 1[an agriculturist or a labourer of \na domestic servant] and occupied by him ; \n (d) books of account ; \n (e) a mere right to sue for damages ; \n (f) any right of personal service ; \n (g) stipends and gratuities allowed to pensioners of th e Government 2[or of a local authority or of \nany other employer], or payable out of any service family pension fund 3notified in the Official \nGazette by 4[the Central Government or the State Government] in  this behalf, and political pensions;  \n5[(h) the wages of labourers and domestic servants, wheth er payable in money or in kind; \n6*** \n7[( i) salary  to the extent of 8[the first 9[one thousand rupees] and two third of the remainde r] 10 [in \nexecution of any decree other than a decree for mai ntenance]:  \n11 [Provided that where any part of such portion of th e salary as is liable to attachment has been under \nattachment, whether continuously or intermittently,  for a total period of twenty-four months, such por tion \nshall be exempt from attachment until the expiry of  a further period of twelve months, and, where such  \nattachment has been made in execution of one and th e same decree, shall, after the attachment has \ncontinued for a total period of twenty-four months,  be finally exempt from attachment in execution of that \ndeeree.]] \n10 [( ia) one-third of the salary in execution of any decre e for maintenance;] \n 12 [(j) the pay and allowances of persons to whom the Air F orce Act, 1950 (45 of 1950) or the Army \nAct, 1950 (46 of 1950), or the Navy Act, 1957 (62 o f 1957), applies;]  \n(k) all compulsory deposits and other sums in or deri ved from any fund to which the Provident Funds Act,  \n13 [1925], (19 of 1925), for the time being applies in  so far as they are declared by the said Act not to  be liable to \nattachment;  \n2[(ka) all deposits and other sums in or derived from any fund to which the Public Provident Fund Act,           \n1968 (23 of 1968), for the time being applies, in s o far as they are declared by the said Act as not t o be liable to \nattachment; \n                                                      \n1. Subs. by Act 104 of 1976, s. 23, for “an agricul turist” (w.e.f. 1-2-1977) \n2. Ins. by s. 23, ibid ., (w.e.f. 1-2-1977). \n3. For such a notification, see  Gazette of India, 1909, Pt I, p. 5. \n4. Such by the A.O. 1937, for “the G.G. in C.”  \n5. Subs. by Act 9 of 1937, s. 2, for cls. (h) and (i). The amendments made by that section have no effect in respect of any proceedings \narising out of a suit instituted before 1st June, 1 937, see ibid., s. 3. \n6. The words “and salary, to the extent of the firs t hundred rupees and one-half the remainder of such  salary” omitted by Act 5 of 1943,  \ns. 2. \n7. Subs. by s. 2, ibid., for clause ( i) and the proviso. \n8. Subs. by Act 26 of 1963, s. 2, for “the first hu ndred rupees”. \n9. Subs. by Act 46 of 1999, s. 6, for “four hundred  rupees” (w.e.f. 1-7-2002).  \n10. Ins. by Act 66 of 1956, s. 6. \n11. Subs. by Act 104 of 1976, s. 23, for the provis o (w.e.f. 1-2-1977). \n12. Subs. by s. 23, ibid ., for clause ( j) (w.e.f. 1-2-1977). \n13. Subs. by Act 9 of 1937, s. 2, for “1897”.  27 (kb ) all moneys payable under a policy of insurance on t he life of the judgment debtor; \n(kc ) the interest of a lessee of a residential buildin g to which the provisions of law for the time being  \nin force relating to control of rents and accommoda tion apply;] \n1[( 1) any allowance forming part of the emoluments of any  2[servant of the 3[Government]] or of any \nservant of a railway company or local authority whi ch the 4[appropriate Government] may by notification in the  \nOfficial Gazette declare to be exempt from attachme nt, and any subsistence grant or allowance made to 5[any \nsuch servant] while under suspension;] \n(m) an expectancy of succession by survivorship or othe r merely contingent or possible right or interest;  \n(n) a right to future maintenance; \n(o) any  allowance declared by 6[any Indian law] to be exempt from liability to att achment or sale in execution \nof a decree, and  \n(p) where the judgment-debtor is a person liable for th e payment of land-revenue, any movable property \nwhich, under any law for the time being applicable to him, is exempt from .sale for the recovery of an arrear of \nsuch revenue.  \n7[Explanation 1.  —The  moneys payable in relation to the matters mentioned  in clauses (g), ( h), (i), ( ia ), ( j), ( l) and \n(o) are exempt from attachment or sale, whether before or after they are actually payable, and, in the cas e of salary, \nthe attachable portion thereof is liable to attachm ent whether before or after it is actually payable. ]  \n8[9[Explanation II.  —In  clauses ( i) and ( ia)] , “salary” means the total monthly emoluments, exclud ing any \nallowance declared exempt from attachment under the  provisions of clause ( 1), derived by a person from his \nemployment whether on duty or on leave.]  \n10 [Explanation 11 [III ].—In clause ( 1) “appropriate Government” means—  \n(i) as respects any 12 [person] in the service of the Central Government, or any servant of 13 [a Railway \nAdministration] or of a cantonment authority or of the port authority of a major port, the Central Gov ernment;  \n14 *   *   *   *   * \n(iii ) as respects any other 2[servant of the 3[Government]] or a servant of any other 15 *** local authority, the \nState Government.]  \n16 [Explanation IV— For  the purposes of this proviso, “wages” includes bonu s, and “labourer” includes a skilled \nunskilled or semi-skilled labourer.  \nExplanation V— For  the purposes of this proviso, the expression “agric ulturist” means a person who cultivates \nland personally and who depends for his livelihood mainly on the income from agricultural land, whethe r as owner, \ntenant, partner or agricultural labourer.  \nExplanation VI— For  the purposes of Explanation V  an agriculturist shall be deemded to cultivate lan d \npersonally, if he cultivates land—  \n(a) by his own labour, or \n(b) by the labour of any member of his family, or \n(c) by servants or labourers on wages payable in cash  or in kind (not being as a share of the produce), or \nboth.] \n16 [(IA ) Notwithstanding anything contained in any other law  for the time being in force, an agreement by which  \na person agrees to waive the benefit of any exempti on under this section shall be void.]  \n                                                      \n1. Subs. by Act 9 of 1937, s. 2, for the original c lause ( l), see also footnote 3. \n2. Subs. by Act 5 of 1943, s. 2, for “public office r”. \n3. Subs. by the A.O. 1950 for “crown”.  \n4. Subs. by the A.O. 1937, for “G.G. in C”.  \n5. Subs. by Act 5 of 1943, s. 2, “any such officer or servant”. \n6. Subs. by the A.O. 1937, for “any law passed unde r the Indian Councils Act 1861 and 1892”. \n7. Subs. by Act 104 of 1976, s. 23 for Explanation I  (w.e.f. 1-2-1977). \n8. Added by Act 9 of 1937, s. 2, The amendments mad e by that section shall not effect in respect of an y proceeding arising out of any \nsuit instituted before 1 st  June, 1937, see ibid., s. 3.   \n9. Subs. by Act 104 of 1976, s. 23, “ Explanation  2.  —in clauses ( h) and ( i)” (w.e.f. 1-2- 1977). \n10. Ins. by the A.O. 1937. \n11. Subs. by Act 104 of 1976, s. 23, for  “3” (w.e. f. 1-2-1977). \n12. Subs. by Act 5 of 1943, s. 2, for “Public offic er”. \n13. Subs. by the Act A.O. 1950, for “a Federal Rail way”.  \n14. Clause ( ii ) omitted by the A.O. 1948. \n15. The words “railway or” omitted by the A.O. 1950 .  \n16. Ins. by Act 104 of 1976, s. 23 (w.e.f. 1-2-1977 ).  ",
    "61": "—The State Government 2*** may, by general or \nspecial order published in the Official Gazette, de clare that such portion of agricultural produce, or  of any \nclass of agricultural produce, as may appear to the  State Government to be necessary for the purpose o f \nproviding until the next harvest for the due cultiv ation of the land and for the support of the judgme nt-\ndebtor and his family, shall, in the case of all ag riculturists or of any class of agriculturists, be exempted \nfrom liability to attachment or sale in execution o f a decree. \n",
    "62": " (I) No person executing any process under this Code \ndirecting or authorizing seizure of movable propert y shall enter any dwelling-house after sunset and \nbefore sunrise.  \n(2) No outer door of a dwelling-house shall be broken o pen unless such dwelling-house is in the \noccupancy of the judgment-debtor and he refuses or in any way prevents access thereto, but when the \nperson executing any such process has duly gained a ccess to any dwelling-house, he may break open the \ndoor of any room in which he has reason to believe any such property to be. \n(3) Where a room in a dwelling-house is in the actual  occupancy of a woman who, according to the \ncustoms of the country, does not appear in public, the person executing the process shall give notice to such \nwoman that she is at liberty to withdraw; and, afte r allowing reasonable time for her to withdraw and giving \nher reasonable facility for withdrawing, he may ent er such room for the purpose of seizing the propert y, using \nat the same time every precaution, consistent with these provisions, to prevent its clandestine remova l. \n",
    "63": " (1) Where property not in the \ncustody of any Court is under attachment in executi on of decrees of more Courts than one, the Court wh ich \nshall receive or realize such property and shall de termine any claim thereto and any objection to the   \nattachment thereof shall be the Court of highest gr ade, or, where there is no difference in grade betw een such \nCourts, the Court under whose decree the property w as first attached.  \n(2) Nothing in this section shall be deemed to invalida te any proceeding taken by a Court executing \none of such decrees.  \n3[Explanation.— For  the purposes of sub-section ( 2), “proceeding taken by a Court” does not include \nan order allowing, to a decree-holder who has purch ased property at a sale held in execution of a decr ee, \nset off to the extent of the purchase price payable  by him.] \n",
    "64": "—For the purpose of this section, claims enforceabl e under an attachment include \nclaims for the rateable distribution of assets.  \nSA L E  \n",
    "65": " Where  immovable property is sold in execution of a decree  and such sale has \nbecome absolute, the property shall be deemed to ha ve vested in the purchaser from the time when the \nproperty is sold and not from the time when the sal e becomes absolute.   \n6*   *   *  *   * ",
    "66": "",
    "67": "— 1[( 1)] The State Government 2*** may, by notification in the Official Gazette, m ake rules for any local area \nimposing conditions in respect of the sale of any c lass of interests in land in execution of decrees f or the paymant of \nmoney, where such interest are so uncertain or unde termined as, in the opinion of the State Government , to make it \nimpossible to fix their value.  \n3[(2) When on the date on which this Code came into opera tion in any local area, any special rules as to sal e of \nand in execution of decrees were in force therein, the State Government may, by notification in the Of ficial Gazette \ndeclare such rules to be in force, or may 2*** by a like notification, modify the same. \nEvery notification issued in the exercise of the po wers conferred by this sub-section shall set out th e rules so \ncontinued or modified.] \n4[(3) Every rule made under this section shall be laid, a s soon as may be after it is made, before the State  \nLegislature.] \nDELEGATION TO COLLECTOR OF POWER TO EXECUTE DECREES  AGAINST IMMOVABLE \nPROPERTY \n",
    "68": "",
    "69": "",
    "70": "",
    "71": "",
    "72": "",
    "73": " (1) Where assets are held \nby a Court and more persons than one have, before t he receipt of such assets, made application to the Court for the \nexecution of decrees for the payment of money passe d against the same judgment-debtor and have not obt ained \nsatisfaction thereof, the assets, after deducting t he costs of realization, shall be rateably distribu ted among all such \npersons : \nProvided as follows :—  \n(a) where any property is sold subject to a mortgage or  charge, the mortgage or incumbrancer shall not be \nentitled to share in any surplus arising from such sale;  \n(b) where any property liable to be sold in execution o f a decree is subject to a mortgage or charge, the Court \nmay, with the consent of the mortgagee or incumbran cer, order that the property be sold free from the mortgage or \ncharge, giving to the mortgagee or incumbrancer the  same interest in the proceeds of the sale as he ha d in the \nproperty sold;  \n(c) where any immovable property is sold in execution o f a decree ordering its sale for the discharge of a n \nincumbrance thereon, the proceeds of sale shall be applied—  \nFirst, in defraying the expenses of the sale; \nSecondly, in descharging the amount due under the d ecree; \nthirdly, in discharging the interest and principal monies due on subsequent incumbrances (if any); and     \n fourthly, rateably among the holders of decrees fo r the payment of money against the judgement-debtor , who \nhave, prior to the sale of the property, applied to  the Court which passed the decree ordering such sa le for execution \nof such decrees, and have no obtained satisfaction thereof. \n(2) Where all or any of the assets liable to be ratea bly distributed under this section are paid to a pe rson \nnot entitled to receive the same, any person so ent itled may sue such person to compel him to refund t he assets. \n(3) Nothing in this section affects any right of the Government.  \nRESISTANCE TO EXECUTION \n",
    "74": " Where the Court is satisfied that the holder of a d ecree for the possession of \nimmovable property or that the purchaser of immovab le property sold in execution of a decree has been resisted or \nobstructed in obtaining possession of the property by the judgment-debtor or some person on his behalf  and that \nsuch resistance or obstruction was without any just  cause, the Court may, at the instance of the decre e-holder or \npurchaser, order the judgment-debtor or such other person to be detained in the civil prison for a ter m which may \nextend to thirty days and may further direct that t he decree-holder or purchaser be put into possessio n of the \nproperty.  ",
    "75": " Subject  to such conditions and limitations as may be prescr ibed, \nthe Court may issue a commission—  \n(a) to examine any person;  \n(b) to make a local investigation;  \n(c) to examine or adjust accounts; or \n(d) to make a partition;  \n1[( e) to hold a scientific, technical, or expert invest igation; \n(f) to conduct sale of property which is subject to s peedy and natural decay and which is in the \ncustody of the Court pending the determination of t he suit; \n(g) to perform any ministerial act.] \n",
    "76": "—(1) A commission for the examination of any person ma y be issued \nto any Court (not being a High Court) situate in a State other than the State in which the Court of is sue is \nsituate and having jurisdiction in the place in whi ch the person to be examined resides. \n(2) Every Court receiving a commission for the examin ation of any person under sub-section ( 1) shall \nexamine him or cause him to be examined pursuant th ereto, and the commission, when it has been duly \nexecuted, shall be returned together with the evide nce taken under it to the Court from which it was i ssued, \nunless the order for issuing the commission has oth erwise directed, in which case the commission shall  be \nreturned in terms of such order. \n",
    "77": "—In lieu of issuing a commission the Court may issu e a letter of request to examine \na witness residing at any place not within 2[India] \n3[",
    "78": "—Subject to such conditions and limitations as may be \nprescribed the provisions as to the execution and r eturn of commissions for the examination of witness es shall \napply to commissions issued by or at the instance o f—  \n(a) Courts situate in any part of India to which the provisions of this Code do not extend; or \n(b) Courts established or continued by the authority of the Central Government outside India; or \n(c) Courts of any State or country outside India.]  \nPART IV \nSUITS IN PARTICULAR  CASES  \nSUITS BY OR AGAINST THE GOVERNMENT OR PUBLIC OFFICERS IN THE IR OFFICIAL CAPACITY \n4[",
    "79": " In a suit by or against the Government, the authori ty to be named \nas plaintiff or defendant, as the case may be, shal l be—  \n(a)  in the case of a suit by or against the Central Government, 5[the Union of India], and \n(b) in the case of a suit by or against a State Gover nment, the State.] \n",
    "80": "— 6[( 1)] 7[ Save as otherwise provided in sub-section ( 2), no suits 8[shall be instituted] against \nthe Government (including the Government of the Sta te of Jammu and Kashmir)] or against a public offic er in \nrespect of any act purporting to be done by such pu blic officer in his official capacity, until the ex piration of \ntwo months next after notice in writing has been 9[delivered to, or left at the office of—] \n(a) in the case of a suit against the Central Governm ent, 10 [except where it relates to a railway] a \nSecretary to that Government; ",
    "81": "—In a suit instituted against a public officer \nin respect of any act purporting to be done by him in his official capacity—  \n(a) the defendant shall not be liable to arrest nor h is property to attachment otherwise than in \nexecution of a decree, and, \n(b) where the Court is satisfied that the defendant c annot absent himself from his duty without \ndetriment to the public service, it shall exempt hi m from appearing in person.. \n",
    "82": "—7[(I) Where, in a suit by or against the Government or by or against a \npublic officer in respect of any act purporting to be done by him in his official capacity, a decree i s passed \nagainst the Union of India or a State or, as the ca se may be, the public officer, such decree shall no t be \nexecuted except in accordance with the provisions o f sub-section ( 2).] \n ",
    "83": "—Alien enemies residing in India with the permissio n of the Central \nGovernment, and alien friends, may sue in any Court  otherwise competent to try the suit, as if they we re \ncitizens of India, but alien enemies residing in In dia without such permission, or residing in a forei gn country, \nshall not sue in any such Court. \nExplanation. —Every person residing in a foreign country, the Go vernment of which is at war with India \nand carrying on business in that country without a licence in that behalf granted by the Central Gover nment, \nshall, for the purpose of this section, be deemed t o be an alien enemy residing in a foreign country.  \n",
    "84": " A foreign State may sue in any competent Court :  \nProvided that the object of the suit is to enforce a private right vested in the Ruler of such State o r in \nany officer of such State in his public capacity. \n",
    "85": " (1) The Central Government may, at the request of the R uler of a foreign State or at the request of \nany person competent in the opinion of the Central Government to act on behalf of such Ruler, by order , \nappoint any persons to prosecute or defend any suit  on behalf of such Ruler, and any persons so appoin ted \nshall be deemed to be the recognized agents by whom  appearances, acts and applications under this Code  \nmay be made or done on behalf of such Ruler.  \n(2) An appointment under this section may be made for  the purpose of a specified suit or of several \nspecified suits, or for the purpose of all such sui ts as it may from time to time be necessary to pros ecute or \ndefend on behalf of such Ruler. \n(3) A person appointed under this section may authori se or appoint any other persons to make \nappearances and applications and do acts in any suc h suit or suits as if he were himself a party there to. \n",
    "86": " (I) No. 5*** foreign State may be \nsued in any Court otherwise competent to try the su it except with the consent of the Central Governmen t \ncertified in writing by a Secretary to that Governm ent :  \nProvided that a person may, as a tenant of immovabl e property, sue without such consent as aforesaid \n6[a foreign State] from whom he holds or claims to h old the property. \n(2) Such consent may be given with respect to a specifi ed suit or to several specified suits or with \nrespect to all suits of any specified class or clas ses, and may specify, in the case of any suit or cl ass of \nsuits, the Court in which 7[the foreign State] may be sued, but it shall not b e given, unless it appears to the \nCentral Government that 7[the foreign State]—  \n(a) has instituted a suit in the Court against the pers on desiring to sue 8[it], or  ",
    "87": "—The Ruler of a foreign State may sue, and shall be  sued, \nin the name of his State: \nProvided that in giving the consent referred to in section 86, the Central Government may direct that the \nRuler may be sued in the name of an agent or in any  other name. \n87A. Definitions of “Foreign State” and “Rulers” — (1) In this Part,—  \n(a) “foreign State” means any State outside India whi ch has been recognised by the Central \nGovernment; and \n(b) “Ruler”, in relation to a foreign State, means th e person who is for the time being recognized by \nthe Central Government to be the head of that State . \n(2) Every Court shall take judicial notice of the fac t—  \n(a) that a State has or has not been recognized by th e Central Government; \n(b) that a person has or has not been recognized by t he Central Government to be the head of a State. \nSUITS AGAINST RULERS OF FORMER INDIAN STATES \n87B. Applications of sections 85 and 86 to Rulers o f former Indian States .—8[(I) In the case of any \nsuit by or against the Ruler of any former Indian S tate which is based wholly or in part upon a cause of action \nwhich arose before the commencement of the Constitu tion or any proceeding arising out of such suit, th e \nprovisions of section 85 and sub-sections ( 1) and ( 3) of section 86 shall apply in relation to such Rul er as they \napply in relation to the Ruler of a foreign State.]  ",
    "88": " Where  two or more persons claim adversely to \none another the same debts, sum of money or other p roperty, movable or immovable, from another \nperson, who claims no interest therein other than f or charges or costs and who is ready to pay or deli ver it \nto the rightful claimant, such other person may ins titute a suit of interpleader against all the claim ants for \nthe purpose of obtaining a decision as to the perso n to whom the payment or delivery shall be made and  \nof obtaining indemnity for himself :  \nProvided that where any suit is pending in which th e rights of all parties can properly be decided, no  \nsuch suit of interpleader shall be instituted. \nPART V \nSPECIAL PROCEEDINGS  \nARBITRATION  \n3[",
    "89": " (1) Where it appears to the Court that there exist \nelements of a settlement which may be acceptable to  the parties, the Court shall formulate the terms o f \nsettlement and give them to the parties for their o bservations and after receiving the observations of  the \nparties, the Court may reformulate the terms of a p ossible settlement and refer the same for :—  \n(a) arbitration; \n(b) conciliation; \n(c) judicial settlement including settlement through Lok Adalat: or \n(d) mediation. \n(2) Were a dispute has been referred—  \n(a) for arbitration or conciliation, the provisions o f the Arbitration and Conciliation Act,         \n1996 (26 of 1996) shall apply as if the proceedings  for arbitration or conciliation were referred for \nsettlement under the provisions of that Act; \n(b) to Lok Adalat, the Court shall refer the same to the Lok Adalat in accordance with the provisions \nof sub-section ( 1) of section 20 of the Legal Services Authority Act , 1987 (39 of 1987) and all other \nprovisions of that Act shall .apply in respect of the dispute so referred to the Lok Adalat; \n(c) for judicial settlement, the Court shall refer th e same to a suitable institution or person and \nsuch institution or person shall be deemed to be a Lok Adalat and all the provisions of the Legal \nServices Authority Act, 1987 (39 of 1987) shall app ly as if the dispute were referred to a Lok Adalat \nunder the provisions of that Act; \n(d) for mediation, the Court shall effect a compromis e between the parties and shall follow such \nprocedure as may be prescribed.] \nSPECIAL CASE \n",
    "90": " Where  any persons agree in writing to state a case \nfor the opinion of the Court, then the Court shall try and determine the same in the manner prescribed .  \n  ",
    "91": "2[(1) In the case of a public \nnuisance or other wrongful act affecting, or likely  to affect, the public, a suit for a declaration an d injunction \nor for such other relief as may be appropriate in t he circumstances of the case, may be instituted,—  \n(a) by the Advocate-General, or \n(b) with the leave of the Court, by two or more perso ns, even though no special damage has been \ncaused to such persons by reason of such public nui sance or other wrongful act.] \n(2) Nothing in this section shall be deemed to limit or  otherwise affect any right of suit which may \nexist independently of its provisions.  \n3",
    "92": " (1) In the case of any alleged breach of any express or constructive trust \ncreated for public purposes of a charitable or reli gious nature, or where the direction of the Court i s \ndeemed necessary for the administration of any such  trust, the Advocate-General, or two or more person s \nhaving an interest in the trust and having obtained  the 4[leave of the Court,] may institute a suit, whether  \ncontentious or not, in the principal Civil Court of  original jurisdiction or in any other Court empowe red in \nthat behalf by the State Government within the loca l limits of whose jurisdiction the whole or any par t of \nthe subject-matter of the trust is situate to obtai n a decree :—  \n(a) removing any trustee; \n(b) appointing a new trustee; \n(c) vesting any property in a trustee; \n5[( cc ) directing a trustee who has been removed or a per son who has ceased to be a trustee, to \ndeliver possession of any trust property in his pos session to the person entitled to the possession of  \nsuch property]; \n(d) directing accounts and inquiries; \n(e) declaring what proportion of the trust property o r of the interest therein shall be allocated to \nany particular object of the trust; \n(f) authorizing the whole or any part of the trust pr operty to be let, sold, mortgaged or exchanged; \n(g) settling a scheme; or \n(h) granting such further or other relief as the natu re of the case may require. \n(2) Save as provided by the Religious Endowments Act, 1 863 (XX of 1863), 6[or by any \ncorresponding law in force in 7[the territories which, immediately before the 1st November, 1956, were \ncomprised in Part B States]], no suit claiming any of the reliefs specified in sub-section (1) shall be \ninstituted in respect of any such trust as is there in referred to except in conformity with the provis ions of \nthat sub-section.  \n8[( 3) The Court may alter the original purposes of an e xpress or constructive trust created for public \npurposes of a charitable or religious nature and al low the property or income of such trust or any por tion \nthereof to be applied cy pres in one or more of the following circumstances, name ly :—  \n(a) where the original purposes of the trust, in whole or in part, —  \n(i) have been, as far as may be, fulfilled; or \n(ii ) cannot be carried out at all, or cannot be carried out according to the directions given in \nthe instrument creating the trust or, where there i s no such instrument, according to the spirit of \nthe trust; or  ",
    "93": " The  powers conferred by \nsections 91 and 92 on the Advocate-General may, out side the presidency-towns, be, with the previous \nsanction of the State Government, exercised also by  the Collector or by such officer as the State \nGovernment may appoint in this behalf. \nPART VI \nSUPPLEMENTAL PROCEEDINGS \n",
    "94": " In  order to prevent the ends of justice from being def eated the \nCourt may, if it is so prescribed,  —  \n(a) issue a warrant to arrest the defendant and bring h im before the Court to show cause why he \nshould not give security for his appearance, and if  he fails to comply with any order for security com mit \nhim to the civil prison; \n(b) direct the defendant to furnish security to produ ce any property belonging to him and to place \nthe same at the disposal of the Court or order the attachment of any property; \n(c) grant a temporary injunction and in case of disob edience commit the person guilty thereof to \nthe civil prison and order that his property be att ached and sold; \n(d) appoint a receiver of any property and enforce th e performance of his duties by attaching and \nselling his property; \n(e) make such other interlocutory orders as may appea r to the Court to be just and convenient. \n",
    "95": " (1) Where, in any suit in which an arrest or attachme nt has been effected or a temporary \ninjunction granted under the last preceding section ,—  \n(a) it appears to the Court that such arrest, attachmen t or injunction was applied for on \ninsufficient grounds, or \n(b) the suit of the plaintiff fails and it appears to  the Court that there was no reasonable or \nprobable grounds for instituting the same, \nthe defendant may apply to the Court, and the Court  may, upon such application, award against the \nplaintiff by its order such amount 1[not exceeding fifty thousand rupees], as it deems a reasonable \ncompensation to the defendant for the 2[expense or injury (including injury to reputation)  caused to him]: \nProvided that a Court shall not award, under this s ection, an amount exceeding the limits of its \npecuniar jurisdiction. \n(2) An order determining any such application shall bar  any suit for compensation in respect of such \narrest, attachment or injunction.  \n  ",
    "96": " (1) Save where otherwise expressly provided in the body  of this \nCode or by any other law for the time being in forc e, an appeal shall lie from every decree passed by any \nCourt exercising original jurisdiction to the Court  authorized to hear appeals from the decisions of s uch \nCourt. \n(2) An appeal may lie from an original decree passed ex parte. \n(3) No appeal shall lie from a decree passed by the C ourt with the consent of parties. \n1[( 4) No appeal shall lie, except on a question of law, f rom a decree in any suit of the nature \ncognisable by Courts of Small Causes, when the amou nt or value of the subject-matter of the original s uit \ndoes not exceed 2[ten thousand rupees.]] \n",
    "97": " Where  any party \naggrieved by a preliminary decree passed after the commencement of this Code does not appeal from such  \ndecree, he shall be precluded from disputing its co rrectness in any appeal which may be preferred from  \nthe final decree. \n",
    "98": " (1) Where an appeal is heard by a Bench \nof two or more Judges, the appeal shall be decided in accordance with the opinion of such Judges or of  \nthe majority (if any) of such Judges. \n(2) Where there is no such majority which concurs in a judgment varying or reversing the decree \nappealed from, such decree shall be confirmed :  \nProvided that where the Bench hearing the appeal is  3[composed of two or other even number of \nJudges belonging to a Court consisting of more Judg es than those constituting the Bench] and the Judge s \ncomposing the Bench differ in opinion on a point of  law, they may state the point of law upon which th ey \ndiffer and the appeal shall then be heard upon that  point only by one or more of the other Judges, and  \nsuch point shall be decided according to the opinio n of the majority (if any) of the Judges who have h eard \nthe appeal, including those who first heard it. \n4[( 3) Nothing in this section shall be deemed to alter or otherwise affect any provision of the letters to  \npatent of any High Court.]  \n",
    "99": " No decree shall be reversed or substantially varied , nor shall any case be remanded, in appeal \non account of any misjoinder 5[or non-joinder] of parties or causes of action or any error, defect or irregularity \nin any proceedings in the suit, not affecting the m erits of the case or the jurisdiction of the Court : \n6[Provided that nothing in this section shall apply t o non-joinder of a necessary party.]  \n7[99A. No order under section 47 to be reversed or mo dified unless decision of the case is \nprejudicially affected.— Without  prejudice to the generality of the provisions of se ction 99, no order under \nsection 47 shall be reversed or substantially varie d, on account of any error, defect or irregularity in any \nproceeding relating to such order, unless such erro r, defect or irregularity has prejudicially affecte d the decision \nof the case.]  \nAPPEALS FROM APPELLATE DECREES \n8[",
    "100": " (1) Save as otherwise expressly provided in the body of  this Code or by any \nother law for the time being in force, an appeal sh all lie to the High Court from every decree passed in \nappeal by any Court subordinate to the High Court, if the High Court is satisfied that the case involv es a \nsubstantial question of law. ",
    "101": " No second appeal shall lie except on the ground \nmentioned in section 100. \n2[",
    "102": " No second appeal shall lie from any decree, when th e \nsubject matter of the original suit is for recovery  of money not exceeding twenty-five thousand rupees .] \n3[",
    "103": "In any second appeal, the High Court \nmay, if the evidence on the record is sufficient, d etermine any issue necessary for the disposal of th e \nappeal,—  \n(a) which has not been determined by the lower Appeal late Court or both by the Court of first \ninstance and the lower Appellate Court, or \n(b) which has been wrongly determined by such Court o r Courts by reason of a decision on such \nquestion of law as is referred to in section 100.] \nAPPEALS FROM ORDERS  \n",
    "104": " (1) An appeal shall lie from the following orders, an d save as \notherwise expressely provided in the body of this C ode or by any law for the time being in force, from  no \nother orders: — \n4*  *   *   *   * \n5[( ff ) an order under section 35A;] \n6[(ffa) an order under section 91 or section 92 refusing le ave to institute a suit of the nature \nreferred to in section 91 or section 92, as the cas e may be;] \n(g) an order under section 95; \n(h) an order under any of the provisions of this Code  imposing a fine or directing the arrest or \ndetention in the civil prison of any person except where such arrest or detention is in execution of a  \ndecree; \n(i) any order made under rules from which an appeal is expressly allowed by rules: \n5[Provided that no appeal shall lie against any orde r specified in clause ( ff ) save on the ground \nthat no order, or an order for the payment of a les s amount, ought to have been made.]  \n(2) No appeal shall lie from any order passed in appeal  under this section. ",
    "105": " (1) Save as otherwise expressly provided, no appeal s hall lie from any order \nmade by a Court in the exercise of its original or appellate jurisdiction; but where a decree is appea led \nfrom, any error, defect or irregularity in any orde r, affecting the decision of the case, may be set f orth as a \nground of objection in the memorandum of appeal. \n(2) Notwithstanding anything contained in sub-section ( 1), where any party aggrieved by an order of \nremand 1***from which an appeals lies does not appeal there from, he shall thereafter be precluded from \ndisputing its correctness. \n",
    "106": " Where an appeal from any order is allowed it shall lie to the Court \nto which an appeal would lie from the decree in the  suit in which such order was made, or where such o rder is \nmade by a Court (not being a High Court) in the exe rcise of appellate jurisdiction, then to the High C ourt. \nGENERAL  PROVISIONS RELATING TO APPEALS  \n",
    "107": " (1) Subject to such conditions and limitaitons as may  be \nprescribed, an Appellate Court shall have power— \n(a) to determine a case finally; \n(b) to remand a case; \n(c) to frame issues and refer them for trial; \n(d) to take additional evidence or to require such ev idence to be taken. \n(2) Subject as aforesaid, the Appellate Court shall hav e the same powers and shall perform as nearly \nas may be the same duties as are conferred and impo sed by this Code on Courts of original jurisdiction  in \nrespect of suits instituted therein. \n",
    "108": " The provisions of this Part \nrelating to appeals from original decrees shall, so  far as may be, apply to appeals— \n(a) from appellate decrees, and \n(b) from orders made under this Code or under any spe cial or local law in which a different \nprocedure is not provided. \nAPPEALS TO THE SUPREME  COURT  \n2[",
    "109": " Subject to the provisions in Chapter IV of Part V o f \nthe Constitution and such rules as may, from time t o time, be made by the Supreme Court regarding appe als \nfrom the Courts of India, and to the provisions her einafter contained, an appeal shall lie to the Supr eme Court \nfrom any judgment, decree or final order in a civil  proceeding of a High Court, if the High Court cert ifies— \n(i) that the case involves a substantial question of law of general importance; and \n(ii ) that in the opinion of the High Court the said qu estion needs to be decided by the Supreme Court.] \n",
    "110": "",
    "111": "",
    "112": "4[(1) Nothing contained in this Code shall be deemed— \n(a) to affect the powers of the Supreme Court under a rticle 136 or any other provision of the \nConstitution; or \n(b) to interfere with any rules made by the Supreme C ourt, and for the time being in force for the \npresentation of appeals to that Court, or their con duct before that Court.] \n(2) Nothing herein contained applies to any matter of c riminal or admiralty or vice-admiralty \njurisdiction or to appeals from orders and decrees of Prize Courts.  ",
    "113": " Subject to such conditions and limitations as may b e prescribed, \nany Court may state a case and refer the same for t he opinion of the High Court, and the High Court ma y \nmake such order thereon as it thinks fit: \n1[Provided that where the Court is satisfied that a case pending before it involves a question as to th e \nvalidity of any Act, Ordinance or Regulation or of any provision contained in an Act, Ordinance or \nRegulation, the determination of which is necessary  for the disposal of the case, and is of opinion th at \nsuch Act, Ordinance, Regulation or provision is inv alid or inoperative, but has not been so declared b y the \nHigh Court to which that Court is subordinate or by  the Supreme Court, the Court shall state a case \nsetting out its opinion and the reasons therefor, a nd refer the same for the opinion of the High Court . \nExplanation. —In this section, “Regulation” means any Regulation  of the Bengal, Bombay or Madras \nCode or Regulation as defined in the General Clause s Act,1897, (10 of 1897) or in the General Clauses \nAct of a State.] \n",
    "114": "Subject as aforesaid, any person considering hims elf aggrieved— \n(a) by a decree or order from which an appeal is allowe d by this Code, but from which no appeal \nhas been preferred. \n(b) by a decree or order from which no appeal is allo wed by this Code, or \n(c) by a decision on a reference from a Court of Small Causes,  \nmay apply for a review of judgment to the Court whi ch passed the decree or made the order, and the \nCourt may make such order thereon as it thinks fit.  \n",
    "115": "—2[( 1)] The High Court may call for the record of any ca se which has been decided by \nany Court subordinate to such High Court and in whi ch no appeal lies thereto, and if such subordinate \nCourt appears— \n(a) to have exercised a jurisdiction not vested in it  by law, or \n(b) to have failed to exercise a jurisdiction so vest ed, or \n(c) to have acted in the exercise of its jurisdiction  illegally or with material irregularity, \nthe High Court may make such order in the case as i t thinks fit: \n3[Provided that the High Court shall not, under this  section, vary or reverse any order made, or any or der \ndeciding an issue, in the course of a suit or other  proceeding, except where the order, if it had been  made in \nfavour of the party applying for revision would hav e finally disposed of the suit or other proceedings .] \n4[( 2) The High Court shall not, under this section, var y or reverse any decree or order against which \nan appeal lies either to the High Court or to any C ourt subordinate thereto. \n5[( 3) A revision shall not operate as a stay of suit or  other proceeding before the Court except where \nsuch suit or other proceeding is stayed by the High  Court.] \nExplanation. —In this section, the expression “any case which ha s been decided” includes any order \nmade, or any order deciding an issue in the course of a suit or other proceeding.]  \nPART IX \nSPECIAL PROVISIONS RELATING TO THE 6[HIGH COURTS 7[NOT BEING THE COURT OF A \nJUDICIAL COMMISSIONER ] \n",
    "116": " This Part applies only to High Courts 7[not being \nthe court of a Judicial Commissioner].  ",
    "117": " Save as provided in this Part or in Part X or in ru les, the \nprovisions of this Court shall apply to such High C ourts. \n",
    "118": " Where any such High Court considers it \nnecessary that a decree passed in the exercise of i ts original civil jurisdiction should be executed b efore \nthe amount of the costs incurred in the suit can be  ascertained by taxation, the Court may order that the \ndecree shall be executed forthwith, except as to so  much thereof as relates to the costs; \nand, as to so much thereof as relates to the costs,  that the decree may be executed as soon as the \namount of the costs shall be ascertained by taxatio n. \n",
    "119": " Nothing  in this Code shall be deemed to \nauthorize any person on behalf of another to addres s the Court in the exercise of its original civil \njurisdiction, or to examine witnesses, except where  the Court shall have in the exercise of the power \nconferred by its charter authorized him so to do, o r to interfere with the power of the High Court to make \nrules concerning advocates, vakils and attorneys. \n",
    "120": " (1) The following provisions \nshall not apply to the High Court in the exercise o f its original civil jurisdiction, namely, sections  16, 17 and 20.  \n1*             *              *                          *                            * \nPART X  \nRULES  \n",
    "121": " The rules in a First Schedule shall have effect as if enacted \nin the body of this Code until annulled or altered in accordance with the provisions of this Part. \n122 . Power of certain High Courts to make rules.—2[High  Courts 3[not being the Court of a \nJudicial Commissioner]] 4*** may, from time to time after previous publicati on, make rules regulating \ntheir own procedure and the procedure of the Civil Courts subjects to their superintendence, and may b y \nsuch rules annul, alter or add to all or any of the  rules in the First Schedule. \n123.  Constitution of Rules Committees in certain States. —(1) A Committee, to be called the Rule \nCommittee, shall be constituted at 5[the town which is the usual place of sitting of ea ch of the High \nCourts 6*** referred to in section 122].  \n(2) Each such Committee shall consist of the following persons, namely:— \n(a) three Judges of the High Court established at the t own at which such Committee is constituted, \none of whom at least has served as a District Judge  or 7*** a Divisional Judge for three years, \n8[( b) two legal practitioners enrolled in that Court,] \n9[( c) a Judge of a Civil Court subordinate to the High Court, 10 *** \n11 *   *   *   *  * 42 (3) The members of each Committee shall be appointed by the 1[High Court], which shall also \nnominate one of their number to be President: \n2*   *   *   *   * \n(4) Each member of any such Committee shall hold offi ce for such period as may be prescribed by \nthe 1[High Court] in this behalf; and whenever any membe r retires, resigns, dies or ceases reside in the \nState in which the Committee was constituted, or be comes incapable of acting as a member of the \nCommittee, the said 1[High Court] may appoint another person to be a mem ber in his stead. \n(5) There shall be a secretary to each such Committee , who shall be appointed by the 1[High Court] \nand shall receive such remuneration as may be provi ded in this behalf 3[by the State Government]. \n124. Committee to report to High Court.— Every Rule Committee shall make a report to the Hig h \nCourt established at the town at which it is consti tuted on any proposal to annul, alter or add to the  rules \nin the First Schedule or to make new rules, and bef ore making any rules under section 122 the High Cou rt \nshall take such report into consideration. \n125 . Power of other High Courts to make rules.— High Courts, other than the Courts specified in \nsection 122, may exercise the powers conferred by t hat section in such manner and subject to such \nconditions 4[as 5[the State Government] may determine:] \nProvided that any such High Court may, after previo us publication, make a rule extending within the \nlocal limits of its jurisdiction any rules which ha ve been made by any other High Court. \n6[126. Rules to be subject to approval.— Rules made under the foregoing provisions shall be subject to \nthe previous approval of the Government of the Stat e in which the Court whose procedure the rules regu late \nis situate or, if that Court is not situate in any State, to the previous approval of 7[Central Government.]] \n127. Publication of rules.— Rules  so made and 8[approved] shall be published in the 9[Official Gazette], and \nshall from the date of publication or from such oth er date as may be specified have the same force and  effect, within \nthe local limits of the jurisdiction of the High Co urt which made them, as if they had been contained in the First \nSchedule. \n128. Matters for which rules may provide.— (1) Such rules shall be not inconsistent with the pro visions in the \nbody of this code, but, subject thereto, may provid e for any matters relating to the procedure of Civi l Courts.  \n(2) In particular, and without prejudice to the gener ality of the powers conferred by sub-section ( 1), \nsuch rules may provide for all or any of the follow ing matters, namely:— \n(a) the service of summonses, notices and other proce sses by post or in any other manner either \ngenerally or in any specified areas, and the proof of such service; \n(b) the maintenance and custody, while under attachme nt, of live-stock and other movable \nproperty, the fees payable for such maintenance and  custody, the sale of such live-stock and property,  \nand the proceeds of such sale; \n(c) procedure in suits by way of counterclaim, and th e valuation of such suits for the purposes of \njurisdiction; \n(d) procedure in garnishee and charging orders either  in addition to, or in substitution for, the \nattachment and sale of debts; \n(e) procedure where the defendant claims to be entitl ed to contribution or indemnity over against \nany person whether a party to the suit or not; \n  \n                                                      \n1. Subs. by Act 104 of 1976, s. 44, for “Chief Justi ce or Chief Judge” (w.e.f. 1-2-1977). \n2. Proviso omitted by s. 44, ibid . (w.e.f. 1-2-1977). \n3. Subs. by the A.O. 1937, for “by the G.G. in C. or  by the L.G., as the case may be”. \n4. Subs. by Act 38 of 1920, s. 2 and the First Sche dule Pt. I, for “as the G.G. in C. may determine”. \n5. Subs. by the A.O.1937, for “in the case of the Co urt of the Judicial Commissioner of Coorg, the G.G. i n C., and, in other cases \nthe L.G.” \n6. Subs., ibid ., for section 126. \n7. Subs. by the A.O. 1950, for “Governor General”. \n8. Subs. by Act 24 of 1917, s. 2 and the First Sche dule, for “sanctioned”. \n9. Subs. by the A.O. 1937, for “Gazette of India or  in the local Official Gazette, as the case may be” . Strictly the substitution \nwould read “Official Gazette or in the Official Gaz ette, as the case may be, but the latter words have  been omitted as being \nredundant”.  43 (f) summary procedure— \n(i) in suits in which the plaintiff seeks only to rec over a debt or liquidated demand in money payable \nby the defendant, with or without interest, arising — \non a contract express or implied; or \non an enactment where the sum sought to be recovere d is a fixed sum of money or in the nature of \na debt other than a penalty; or \non a guarantee, where the claim against the princip al is in respect of a debt or a liquidated demand \nonly; or \non a trust; or \n(ii ) in suits for the recovery of immovable property, with or without a claim for rent or mesne profits, \nby a landlord against a tenant whose term has expir ed or has been duly determined by notice to quit, o r has \nbecome liable to forefeiture for non-payment of ren t, or against persons claiming under such tenant; \n(g) procedure by way of originating summons; \n(h) consolidation of suits, appeals and other proceed ings; \n(i) delegation to any Registrar, Prothonotary or Mast er or other official of the Court of any \njudicial, quasi-judicial and non-judicial duties; a nd \n(j) all forms, registers, books, entries and accounts  which may be necessary or desirable for the \ntransaction of the business of Civil Courts. \n129. Power of High Courts to make rules as to their  original Civil procedure.— Notwithstanding \nanything in this Code, any High Court 1[not being the Court of a Judicial Commissioner] ma y make such \nrules not inconsistent with the Letters Patent 2[or order] 3[or other law] establishing it to regulate its own \nprocedure in the exercise of its original civil jur isdiction as it shall think fit, and nothing herein  contained \nshall affect the validity of any such rules in forc e at the commencement of this Code. \n4[130. Powers of other High Courts to make rules as to matters other than procedure.— A High \nCourt 5[not being a High Court to which section 129 applie s] may, with the previous approval of the State \nGovernment, make with respect to any matter other t han procedure any rule which a High Court 6[for a \n7*** State] might under 8[article 227 of the Constitution] make with respect  to any such matter for any \npart of the territories under its jurisdiction whic h is not included within the limits of a presidency  town.] \n131. Publication of rules.— Rules made in accordance with section 129 or sectio n 130 shall be \npublished in the 9[Official Gazette] and shall from the date of publi cation or from such other date as may \nbe specified have the force of law.  \nPART XI \nMISCELLANEOUS \n132.Exemption of certain women from personal appear ance.— (1) Women who, according to the \ncustoms and manners of the country, ought not to be  compelled to appear in public shall be exempt from  \npersonal appearance in Court. \n(2) Nothing herein contained shall be deemed to exempt such women from arrest in execution of civil \nprocess in any case in which the arrest of women is  not prohibited by this Code.  \n133. Exemption of other persons.—10 [( 1) The following persons shall be entitled to exempt ion from \npersonal appearance in Court, namely:— \n(i) the President of India; \n(ii ) the Vice-President of India; \n                                                      \n1. Subs. by the Adaptation of Laws (No. 2) Order, 1 956, for “for a Part A State or a Part B State”. \n2. Ins. by the A.O. 1950. \n3. Ins. by Act 2 of 1951, s. 17. \n4. Subs. by the A.O. 1937, for s. 130. \n5. Subs. by the A.O. 1950, for “not constituted by His Majesty by Letters Patent”. \n6. Subs., ibid ., for “so constituted”. \n7. The word and letter “Part A” omitted by the Adap tation of Laws (No. 2) Order, 1956. \n8. Subs. by the A.O. 1950, for “section 224 of the Government of India Act, 1935”. \n9. Subs. by the A.O.1937, for “Gazette of India or in the Local Official Gazette, as the case may be”.  Strictly the substitution \nwould read “Official Gazette or in the Official Gaz ette, as the case may be,” but the latter words hav e been omitted as being \nredundant. \n10. Subs. by Act 66 of 1956, s. 12, for sub-section  ( 1).  44 (iii ) the Speaker of the House of the People; \n(iv ) the Ministers of the Union; \n(v) the Judges of the Supreme Court; \n(vi ) the Governors of States and the administrators of  Union territories; \n(vii ) the Speakers of the State Legislative Assemblies;  \n(viii ) the Chairman of the State Legislative Councils; \n(ix ) the Ministers of States; \n(x) the Judges of the High Courts; and \n(xi ) the persons to whom section 87B applies.] \n1*   *   *   *   * \n(3) Where any person 2***  claims the privilege of such exemption, and it is consequently necessary to \nexamine him by commission, he shall pay the costs o f that commission, unless the party requiring his \nevidence pays such costs.  \n134. Arrest other than in execution of decree.— The  provisions of sections 55, 57 and 59 shall \napply, so far as may be, to all persons arrested un der this Code. \n135.  Exemption from arrest under civil process .—(1) No Judge, Magistrate or other judicial officer \nshall be liable to arrest under civil process while  going to, presiding in, or returning from, his Cou rt. \n(2) Where any matter is pending before a tribunal hav ing jurisdiction therein, or believing in good \nfaith that it has such jurisdiction, the parties th ereto, their pleaders, mukhtars, revenue-agents and  \nrecognized agents, and their witnesses acting in ob edience to a summons, shall be exempt from arrest \nunder civil process other than process issued by su ch tribunal for contempt of Court while going to or  \nattending such tribunal for the purpose of such mat ter, and while returning from such tribunal. \n(3) Nothing in sub-section (2) shall enable a judgment-debtor to claim exemption f rom arrest under \nan order for immediate execution or where such judg ment-debtor attends to show cause why he should \nnot be committed to prison in execution of a decree . \n3[135A . Exemption of members of legislative bodies from arr est and detention under civil \nprocess .—4[( 1) No person shall be liable to arrest or detention in prison under civil process— \n(a) if he is a member of— \n(i) either House of Parliament, or \n(ii ) the Legislative Assembly or Legislative Council o f a State, or \n(iii ) a Legislative Assembly of a Union territory, \nduring the continuance of any meeting of such House  of Parliament or, as the case may be, of the \nLegislative Assembly or the Legislative Council; \n(b) if he is a member of any committee of—  \n(i) either House of Parliament, or \n(ii ) the Legislative Assembly of a State or Union terr itory, or \n(iii ) the Legislative Council of a State,  \nduring the continuance of any meeting of such commi ttee; \n(c) if he is a member of—  \n(i) either House of Parliament, or \n                                                      \n1. Sub-section ( 2) omitted by Act 66 of 1966, s. 12. \n2. The words “so exempted” omitted by s. 12, ibid.  \n3. Ins. by Act 23 of 1925, s. 3. \n4. Subs. by Act 104 of 1976, s. 45, for sub-section  (1) (w.e.f. 1-2-1977).  45 (ii ) a Legislative Assembly or Legislative Council of a State having both such Houses,  \nduring the continuance of a joint sitting, meeting,  conference or joint committee of the Houses of \nParliament or, Houses of the State Legislature, as the case may be, \nand during the forty days before and after such mee ting, sitting or conference.] \n(2) A person released from detention under sub-section ( 1) shall, subject to the provisions, of the said  \nsub-section, be liable to re-arrest and to the furt her detention to which he would have been liable if  he had \nnot been released under the provisons of sub-sectio n ( 1).]  \n136. Procedure where person to be arrested or prope rty to be attached is outside district.— (1) \nWhere an application is made that any person shall be arrested or that any property shall be attached \nunder any provision of this Code not relating to th e execution of decrees, and such person resides or such \nproperty is situate outside the local limits of the  jurisdiction of the Court to which the application  is made, \nthe Court may, in its discretion, issue, a warrant of arrest of make an order of attachment, and send to the \nDistrict Court within the local limits of whose jur isdiction such person or property resides or is sit uate a \ncopy of the warrant or order, together with the pro bable amount of the costs of the arrest or attachme nt. \n(2) The District Court shall, on receipt of such copy  and amount, cause the arrest or attachment to be \nmade by its own officers, or by a Court subordinate  to itself, and shall inform the Court which issued  or \nmade such warrant or order of the arrest or attachm ent. \n(3) The Court making an arrest under this section sha ll send the person arrested to the Court by which \nthe warrant of arrest was issued, unless he shows c ause to the satisfaction of the former Court why he  \nshould not be sent to the later Court, or unless he  furnishes sufficient security for his appearance b efore \nthe later Court or for satisfying any decree that m ay be passed against him by that Court, in either o f \nwhich cases the Court making the arrest shall relea se him. \n(4) Where a person to be arrested or movable property  to be attached under this section is within the \nlocal limits of the ordinary original civil jurisdi ction of the High Court of Judicature at Fort Willi am in \nBengal or at Madras or at Bombay, 1*** the copy of the warrant of arrest or of the ord er of attachment, \nand the probable amount of the costs of the arrest or attachment, shall be sent to the Court of Small-\nCauses of Calcutta, Madras 2[or Bombay], as the case may be, and that Court, on  receipt of the copy and \namount, shall proceed as if it were the District Co urt. \n137. Language of subordinate Courts.— (1) The language which, on the commencement of this \nCode, is the language of any Court subordinate to a  High Court shall continue to be the language of su ch \nsubordinate Court until the State Government otherw ise directs. \n(2) The State Government may declare what shall be th e language of any such Court and in what \ncharacter applications to and proceedings in such C ourts shall be written. \n(3) Where this Court requires or allows anything othe r that the recording of evidence to be done in \nwriting in any such Court, such writing may be in E nglish; but if any party or his pleader is unacquai nted \nwith English a translation into the language of the  Court shall, at his request, be supplied to him; a nd the \nCourt shall make such order as it thinks fit in res pect of the payment of the costs of such translatio n. \n3[138. Power of High Court to require evidence to be  recorded in English.— (1) The  4[High \nCourt] may, by notification in the Official Gazette , direct with respect to any Judge specified in the  \nnotification, or falling under a description set fo rth therein, that evidence in cases in which an app eal is \nallowed shall be taken down by him in the English l anguage and in manner prescribed. \n(2) Where a Judge is prevented by any sufficient reason  from complying with a direction under      \nsub-section ( 1), he shall record the reason and cause the evidenc e to be taken down in writing from his \ndictation in open Court.  \n  \n                                                      \n1. The words or “of the Chief Court of Lower Burma” , omitted by the A.O. 1937. \n2. Subs., ibid., for “Bomaby or Rangoon”. \n3. For section 138, as applicable to Assam, see the Civil Procedure (Assam Amendment) Act 1941, (As sam 1 of 1941),                   \ns. 2.  \n4. Subs. by Act 4 of 1914, s. 2 and the Schedule, P t. I for “L.G.”.  46 139. Oath on affidavit by whom to be administered.—  In the case of any affidavit under this Code— \n(a) any Court or Magistrate, or \n1[( aa ) any notary appointed under the Notaries Act, 1952 ( 53 of 1952); or] \n(b) any officer or other person whom a High Court may  appoint in this behalf, or \n(c) any officer appointed by any other Court which th e State Government has generally or \nspecially empowered in this behalf, \nmay administer the oath to the deponent. \n140. Assessors in causes of salvage, etc.— (1) In any admiralty or vice-admiralty cause of salva ge to \nwage or collision the Court, whether it be exercisi ng its original or its appellate jurisdiction, may,  if it \nthinks fit, and shall upon request of either party to such cause, summon to its assistance, in such ma nner as \nit may direct or as may be prescribed, two competen t assessors; and such assessors shall attend and as sist \naccordingly. \n(2) Every such assessor shall receive such fees for his  attendance, to be paid by such of the parties \nas the Court may direct or as may be prescribed. \n141. Miscellaneous proceedings.— The  procedure provided in this Code in regard to suits shall be \nfollowed, as far as it can be made applicable, in a ll proceedings in any Court of civil jurisdiction. \n2[Explanation.— In this section, the expression “proceedings” inclu des proceedings under      \nOrder IX, but does not include any proceedings unde r article 226 of the Constitution.] \n142. Orders and notices to be in writing.— All orders and notices served on or given to any \nperson under the provisions of this Code shall be i n writing. \n143. Postage.— Postage, where chargeable on a notice, summons or l etter issued under this Code \nand forwarded by post, and the fee for registering the same, shall be paid within a time to be fixed \nbefore the communication is made: \nProvided that the State Government 3*** may remit such postage, or fee, or both, or may  prescribe \na scale of court-fees to be levied in lieu thereof.  \n144. Application for restitution.— (1) Where and in so far as a decree 4[or an order] is 5[varied or \nreversed in any appeal, revision or other proceedin g or is set aside or modified in any suit institute d for the \npurpose, the Court which passed the decree or order ] shall, on the application of any party entitled t o any \nbenefit by way of restitution or otherwise, cause s uch restitution to be made as will, so far as may b e, place \nthe parties in the position which they would have o ccupied but for such decree 4[or order] or 5[such part \nthereof as has been varied, reversed, set aside or modified]; and for this purpose, the Court may make  any \norders, including orders for the refund of costs an d for the payment of interest, damages, compensatio n and \nmesne profits, which are properly 5[consequential on such variation, reversal, setting  aside or modification \nof the decree or order]. \n6[Explanation.— For the purposes of sub-section ( 1), the expression “Court which passed the \ndecree or order” shall be deemed to include,— \n(a) where the decree or order has been varied or revers ed in exercise of appellate or revisional \njurisdiction, the Court of first instance; \n(b) where the decree or order has been set aside by a s eparate suit, the court of first instance \nwhich passed such decree or order.  \n \n                                                      \n1. Ins. by Act 104 of 1976, s. 46 (w.e.f. 1-2-1977) . \n2. Ins. by, s. 47, ibid . (w.e.f 1-2-1977). \n3. The words “with the previous sanction of the G.G , in C.” omitted by Act 38 of 1920, s 2 and the Firs t Schedule, Pt. I \n4. Ins. by Act 66 of 1956, s. 13. \n5. Subs. by Act 104 of 1976. s. 48, for certain wor ds (w.e.f. 1-2-1977). \n6. Ins. by. s. 48, ibid . (w.e.f. 1-2-1977).  47 (c) where the Court of first instance has ceased to exi st or has ceased to have jurisdiction to execute, i t, \nthe Court which, if the suit wherein the decree or order was passed were instituted at the time of mak ing \nthe application for restitution under this section,  would have jurisdiction to try such suit.]  \n(2) No suit shall be instituted for the purpose of obta ining any restitution or other relief which could \nbe obtained by application under sub-section ( 1).  \n145. Enforcement of liability of surety.— Where  any person 1[has furnished security or given a \nguarantee]— \n(a) for the performance of any decree or any part the reof, or \n(b) for the restitution of any property taken in exec ution of a decree, or \n(c) for the payment of any money, or for the fulfilme nt of any condition imposed on any person, \nunder an order of the Court in any suit or in any p roceeding consequent thereon, \n1[the decree or order may be executed in the manner therein provided for the execution of decrees, \nnamely:—  \n(i) if he has rendered himself personally liable, again st him to that extent; \n(ii ) if he has furnished any property as security, by sale of such property to the extent of the \nsecurity; \n(iii ) if the case falls both under clauses (i) and (ii) then to the extent specified in those clauses, \nand such person shall, be deemed to be a party with in the meaning of section 47]: \nProvided that such notice as the Court in each case  thinks sufficient has been given to the surety. \n146.  Proceedings by or against representatives.— Save  as otherwise provided by this Code or by \nany law for the time being in force, where any proc eeding may be taken or application made by or again st \nany person then the proceeding may be taken or the application may be made by or against any person \nclaiming under him. \n147.  Consent or agreement by persons under disability.— In  all suits to which any person under \ndisability is a party, any consent or agreement, as  to any proceeding shall, if given or made with the  \nexpress leave of the Court by the next friend or gu ardian for the suit, have the same force and effect  as if \nsuch person, were under no disability and had given  such consent or made such agreement. \n148. Enlargement of time.— Where  any period is fixed or granted by the Court for the  doing of any act \nprescribed or allowed by this Code, the Court may, in its discretion, from time to time, enlarge such period, \n2[not exceeding thirty days in total,] even though t he period originally fixed or granted may have expi red. \n3[148A. Right to lodge a caveat. —(1) Where an application is expected to be made, or has  been \nmade, in a suit or proceeding instituted, or about to be instituted, in a Court , any person claiming a right \nto appear before the Court on the hearing of such a pplication may lodge a caveat in respect thereof. \n(2) Where a caveat has been lodged under sub-section ( 1), the person by whom the caveat has been \nlodged (hereinafter referred to as the caveator) sh all serve a notice of the caveat by registered post , \nacknowledgement due, on the person by whom the appl ication has been, or is expected to be, made, under  \nsub-section ( 1).  \n(3) Where, after a caveat has been lodged under sub-s ection ( 1), any application is filed in any suit or \nproceeding, the Court, shall serve a notice of the application on the caveator. \n(4) Where a notice of any caveat has been served on t he applicant, he shall forthwith furnish the \ncaveator at the caveator’s expense, with a copy of the application made by him and also with copies of  \nany paper or document which has been, or may be, fi led by him in support of the application. \n(5) Where a caveat has been lodged under sub-section ( 1), such caveat shall not remain in force after \nthe expiry of ninety days from the date on which it  was lodged unless the application referred to in  \nsub-section ( 1) has been made before the expiry of the said perio d.] \n                                                      \n1. Subs. by Act 104 of 1976, s. 49, for certain wor ds (w.e.f. 1-2-1977). \n2. Ins. by Act 46 of 1999, s. 13 (w.e.f. 1-7-2002).  \n3. Ins. by Act 104 of 1976, s. 50 (w.e.f. 1-5-1977) .  48 149.  Power to make up deficiency of court-fees.— Where the whole or any part of any fee prescribed f or \nany document by the law for the time being in force  relating to court-fees has not been paid, the Cour t may, in \nits discretion, at any stage, allow the person, by whom such fee is payable, to pay the whole or part,  as the case \nmay be, of such court-fee; and upon such payment th e document, in respect of which fee is payable, sha ll have \nthe same force and effect as if such fee had been p aid in the first instance. \n150.  Transfer of business.— Save as otherwise provided, where the business of a ny Court is transferred \nto any other Court, the Court to which the business  is so transferred shall have the same powers and s hall \nperform the same duties as those respectively confe rred and imposed by or under this Code upon the Cou rt \nfrom which the business was so transferred. \n151.  Saving of inherent powers of Court.— Nothing in this Code shall be deemed to limit or \notherwise affect the inherent power of the Court to  make such orders as may be necessary for the ends of \njustice or to prevent abuse of the process of the C ourt. \n152 . Amendment of judgments, decrees or orders.— Clerical or arithmetical mistakes in \njudgments, decrees or orders or errors arising ther ein from any accidental slip or omission may at any  \ntime be corrected by the Court either of its own mo tion or on the application of any of the parties. \n153.  General power to amend.— The Court may at any time, and on such terms as to costs or otherwise \nas it may think fit, amend any defect or error in a ny proceeding in a suit ; and all necessary amendme nts shall be \nmade for the purpose of determining the real questi on or issue raised by or depending on such proceedi ng. \n1[153A. Power to amend decree or order where appeal is summarily dismissed.— Where an Appellate \nCourt dismisses an appeal under rule 11 of Order XL I, the power of the Court to amend, under section 1 52, the \ndecree or order appealed against may be exercised b y the Court which had passed the decree or order in  the \nfirst, instance, notwithstanding that the dismissal  of the appeal has the effect of confirming the dec ree or order, \nas the case may be, passed by the Court of first in stance. \n153B. Place of trial to be deemed to be open Court .—The place in which any Civil Court is held \nfor the purpose of trying any suit shall be deemed to be an open Court, to which the public generally may \nhave access so far as the same can conveniently con tain them: \nProvided that the presiding Judge may, if he thinks  fit, order at any stage of any inquiry into or tri al of \nany particular case, that the public generally, or any particular person, shall not have access to, or  be or \nremain in, the room or building used by the Court.]  \n154.  [Saving of present right of appeal. ] Rep. by the Repealing and Amending Act, 1952 (48 of 1952 ), \ns. 2 and the First Schedule. \n155.  [Amendment of certain Acts. ] Rep. by  s. 2 and the First Schedule, ibid. \n156.  [Repeals. ] Rep. by the Second Repealing and Amending Act, 1914 (17 of 1914 ). s. 3 and the Second \nSchedule. \n157. Continuance of orders under repealed enactment s.—Notifications published, declarations \nand rules made, places appointed, agreements filed,  scales prescribed, forms framed, appointments made  \nand powers conferred under Act VIII of 1859 or unde r any Code of Civil Procedure or any Act amending \nthe same or under any other enactment hereby repeal ed shall, so far as they are consistent with this C ode, \nhave the same force and effect as if they had been respectively published, made, appointed, filed, \nprescribed, framed and conferred under this Code an d by the authority empowered thereby in such behalf . \n158.  Reference to Code of Civil Procedure and other repe aled enactments.— In  every enactment \nor notification passed or issued before the commenc ement of this Code in which reference is made to or  \nto any Chapter or section of Act VIII of 1859 or an y Code of Civil Procedure or any Act amending the \nsame or any other enactment hereby repealed, such r eference shall, so far as may be practicable, be ta ken \nto be made to this Code or to its corresponding Par t, Order, section or rule. \n \n                                                      \n1. Ins. by Act 104 of 1976. s. 51 (w.e.f. 1-2-1977) . ",
    "122": ""
}