{
    "7[": "",
    "5.": "",
    "0.": "Whoever, in a state of intoxication, appears in \nany public place, or in any place which it is a trespass in him to enter, and there conducts himself in such \na manner as to cause annoyance to any person, shall be punished with simple imprisonment for a term \nwhich may extend to twenty-four hours, or with fine which may extend to ten rupees, or with both. \nCHAPTER XXIII \nOF ATTEMPTS TO COMMIT OFFENCES \n511. Punishment for attempting to commit offences punishable with imprisonment for life or \nother  imprisonment",
    "11": "",
    "2.": "Whoever sells or \noffers for sale any printed or engraved substance containing defamatory matter, knowing that it contains \nsuch matter, shall be punished with simple imprisonment for a term which may extend to two years, or \nwith fine, or with both. \nCHAPTER XXII \nOF CRIMINAL INTIMIDATION, INSULT AND ANNOYANCE \n503. Criminal intimidation",
    "3.": "",
    "4.": "",
    " (": "3) Whoever prints or publishes any matter in relation to any proceeding before a court with respect to \nan offence referred to in sub-section (1) without the previous permission of such court shall be punished \nwith imprisonment of either description for a term which may extend to two years and shall also be liable \nto fine. \nExplanation.—The printing or publication of the judgment of any High Court or the Supreme Court \ndoes not amount to an offence within the meaning of this section.] \n229. Personation of a juror or assessor.—Whoever, by personation or otherwise, shall intentionally \ncause, or knowingly suffer himself to be returned, empanelled or sworn as a juryman or assessor in any \ncase in which he knows that he is not entitled by law to be so returned, empanelled or sworn, or knowing \nhimself to have been so returned, empanelled or sworn contrary to law, shall voluntarily serve on such \njury or as such assessor, shall be punished with imprisonment of either description for a term which may \nextend to two years, or with fine, or with both. \n1[229A. Failure by person released on bail or bond to appear in court.—Whoever, having been \ncharged with an offence and released on bail or on bond without sureties, fails without sufficient cause \n(the burden of proving which shall lie upon him), to appear in court in accordance with the terms of the \nbail or bond, shall be punished with imprisonment of either description for a term which may extend to \none year, or with fine, or with both. \nExplanation.—The punishment under this section is— \n(a) in addition to the punishment to which the offender would be liable on a conviction for the \noffence with which he has been charged; and \n(b) without prejudice to the power of the court to order forfeiture of the bond.] \n \nCHAPTER XII \nOF OFFENCES RELATINGTO COINAND GOVERNMENT STAMPS \n230. “Coin” defined.—2[Coin is metal used for the time being as money, and stamped and issued by \nthe authority of some State or Sovereign Power in order to be so used.] \n3[Indian coin",
    "17": "Whoever, being legally bound to furnish information on any \nsubject to any public servant, as such, furnishes, as true, information on the subject which he knows or \nhas reason to believe to be false shall be punished with simple imprisonment for a term which may extend \nto six months, or with fine which may extend to one thousand rupees, or with both; \nor, if the information which he is legally bound to give respects the commission of an offence, or is \nrequired for the purpose of preventing the commission of an offence, or in order to the apprehension of an \noffender, with imprisonment of either description for a term which may extend to two years, or with fine, \nor with both. \nIllustrations \n(a) A, a landholder, knowing of the commission of a murder within the limits of his estate, wilfully misinforms the \nMagistrate of the district that the death has occurred by accident in consequence of the bite of a snake. A is guilty of the offence \ndefined in this section. \n(b) A, a village watchman, knowing that a considerable body of strangers has passed through his village in order to commit \na dacoity in the house of Z, a wealthy merchant residing in a neighbouring place, and being bound under clause 5, section VII, \n2Regulation III, 1821, of the Bengal Code, to give early and punctual information of the above fact to the officer of the nearest \npolice-station, wilfully misinforms the police officer that a body of suspicious characters passed through the village with a view \nto commit dacoity in a certain distant place in a different direction. Here A is guilty of the offence defined in the latter part of this \nsection. \n3[Explanation.—In section 176 and in this section the word “offence” includes any act committed at \nany place out of 4[India], which, if committed in 3[India], would be punishable under any of the following \nfollowing sections, namely, 302, 304, 382, 392, 393, 394, 395, 396, 397, 398, 399, 402, 435, 436, 449, \n450, 457, 458, 459 and 460; and the word “offender” includes any person who is alleged to have been \nguilty of any such act.] \n178. Refusing oath or affirmation when duly required by public servant to make it.—Whoever \nrefuses to bind himself by an oath 5[or affirmation] to state the truth, when required so to bind himself by \na public servant legally competent to require that he shall so bind himself, shall be punished with simple \nimprisonment for a term which may extend to six months, or with fine which may extend to one thousand \nrupees, or with both. \n179. Refusing to answer public servant authorised to question",
    "18": "",
    "19": "\nWhoever, being a public servant, corruptly or maliciously makes or pronounces in any stage of a judicial \nproceeding, any report, order, verdict, or decision which he knows to be contrary to law, shall be punished \nwith imprisonment of either description for a term which may extend to seven years, or with fine, or with \nboth. \n220. Commitment for trial or confinement by person having authority who knows that he is \nacting contrary to law",
    "22": "Whoever voluntarily causes hurt, if the hurt which he \nintends to cause or knows himself to be likely to cause is grievous hurt, and if the hurt which he causes is \ngrievous hurt, is said “voluntarily to cause grievous hurt”. \nExplanation.—A person is not said voluntarily to cause grievous hurt except when he both causes \ngrievous hurt and intends or knows himself to be likely to cause grievous hurt. But he is said voluntarily \nto cause grievous hurt, if intending or knowing himself to be likely to cause grievous hurt of one kind, he \nactually causes grievous hurt of another kind. \nIllustration \nA, intending of knowing himself to be likely permanently to disfigure Z's face, gives Z a blow which does not permanently \ndisfigure Z's face, but which causes Z to suffer severe bodily pain for the space of twenty days. A has voluntarily caused grievous \nhurt. \n323. Punishment for voluntarily causing hurt",
    "25": "Whoever makes or \nperforms any part of the process of making, or buys, or sells, or disposes or, any instrument for the \npurpose of being used, or knowing or having reason to believe that it is intended to be used, for the \npurpose of counterfeiting any stamp issued by Government for the purpose of revenue, shall be punished \nwith imprisonment of either description for a term which may extend to seven years, and shall also be \nliable to fine. \n258. Sale of counterfeit Government stamp.—Whoever sells, or offers for sale, any stamp which he \nknows or has reason to believe to be a counterfeit of any stamp issued by Government for the purpose of \nrevenue, shall be punished with imprisonment of either description for a term which may extend to seven \nyears, and shall also be liable to fine. \n259. Having possession of counterfeit Government stamp",
    "6.": "",
    "7.": "Whoever has sexual intercourse with a person who is and whom he knows or has \nreason to believe to be the wife of another man, without the consent or connivance of that man, such \nsexual intercourse not amounting to the offence of rape, is guilty of the offence of adultery, and shall be \npunished with imprisonment of either description for a term which may extend to five years, or with fine, \nor with both. In such case the wife shall not be punishable as an abettor. \n498. Enticing or taking away or detaining with criminal intent a married woman",
    "8.": "Whoever voluntarily causes or attempts to cause any person to do anything which that \nperson is not legally bound to do, or to omit to do anything which he is legally entitled to do, by inducing \nor attempting to induce that person to believe that he or any person in whom he is interested will become \nor will be rendered by some act of the offender an object of Divine displeasure if he does not do the thing \nwhich it is the object of the offender to cause him to do, or if he does the thing which it is the object of the \noffender to cause him to omit, shall be punished with imprisonment of either description for a term which \nmay extend to one year, or with fine, or with both. \nIllustrations \n(a) A sits dhurna at Z's door with the intention of causing it to be believed that, by so sitting, he renders Z an object of \nDivine displeasure. A has committed the offence defined in this section. \n(b) A threatens Z that, unless Z performs a certain act, A will kill one of A's own children, under such circumstances that the \nkilling would be believed to render Z an object of Divine displeasure. A has committed the offence defined in this section. \n509. Word, gesture or act intended to insult the modesty of a woman",
    "29": "Whoever commits mischief by killing, poisoning, maiming or rendering useless, any elephant, \ncamel, horse, mule, buffalo, bull, cow or ox, whatever may be the value thereof, or any other animal of \nthe value of fifty rupees or upwards, shall be punished with imprisonment of either description for a term \nwhich may extend to five years, or with fine, or with both. \n430. Mischief by injury to works of irrigation or by wrongfully diverting water",
    "9A": "The words “electronic record” shall have the meaning assigned to \nthem in clause (t) of sub-section (1) of section 2 of the Information Technology Act, 2000 (21 of 2000).] \n30. “Valuable security”",
    "31": "\nWhoever before the birth of any child does any act with the intention of thereby preventing that child \nfrom being born alive or causing it to die after its birth, and does by such act prevent that child from being \nborn alive, or causes it to die after its birth, shall, if such act be not caused in good faith for the purpose of \nsaving the life of the mother, be punished with imprisonment of either description for a term which may \nextend to ten years, or with fine, or with both. \n316. Causing death of quick unborn child by act amounting to culpable homicide.—Whoever \ndoes any act under such circumstances, that if he thereby caused death he would be guilty of culpable \nhomicide,  and does  by such act cause the death of a  quick unborn child, shall be punished with \nimprisonment of either description for a term which may extend to ten years, and shall also be liable to \nfine. \nIllustration \nA, knowing that he is likely to cause the death of a pregnant woman, does an act which, if it caused the death of the woman, \nwould amount to culpable homicide. The woman is injured, but does not die; but the death of an unborn quick child with which \nshe is pregnant is thereby caused. A is guilty of the offence defined in this section. \n317. Exposure and abandonment of child under twelve years, by parent or person having care \nof it.—Whoever being the father or mother of a child under the age of twelve years, or having the care of \nsuch child, shall expose or leave such child in any place with the intention of wholly abandoning such \nchild, shall be punished with imprisonment of either description for a term which may extend to seven \nyears, or with fine, or with both. \nExplanation.—This section is not intended to prevent the trial of the offender for murder or culpable \nhomicide, as the case may be, if the child die in consequence of the exposure. \n318. Concealment of birth by secret disposal of dead body.—Whoever, by secretly burying or \notherwise disposing of the dead body of a child whether such child die before or after or during its birth, \nintentionally  conceals  or  endeavors  to  conceal  the  birth  of  such  child,  shall  be  punished  with \nimprisonment of either description for a term which may extend to two years, or with fine, or with both. \nOf Hurt \n319. Hurt",
    "32": "For the purposes of section 326A and this section, permanent or partial damage or \ndeformity shall not be required to be irreversible.] \n327. Voluntarily causing hurt to extort property, or to constrain to an illegal to an act.—\nWhoever voluntarily causes hurt, for the purpose of extorting from the sufferer, or from any person \ninterested in the sufferer, any property or valuable security, or of constraining the sufferer or any person \ninterested in such sufferer to do anything which is illegal or which may facilitate the commission of an \noffence, shall be punished with imprisonment of either description for a term which may extend to ten \nyears, and shall also be liable to fine. \n328. Causing hurt by means of poison, etc., with intent to commit and offence.—Whoever \nadministers to or causes to be taken by any person any poison or any stupefying, intoxicating or \nunwholesome drug, or other thing with intent to cause hurt to such person, or with intent to commit or to \nfacilitate the commission of an offence or knowing it to be likely that he will thereby cause hurt, shall be \npunished with imprisonment of either description for a term which may extend to ten years, and shall also \nbe liable to fine.  \n329. Voluntarily causing grievous hurt to extort property, or to constrain to an illegal act",
    "1[": "",
    "34": "Whoever  wrongfully  restrains  any  person  shall  be \npunished with simple imprisonment for a term which may extend to one month, or with fine which may \nextend to five hundred rupees, or with both. \n342. Punishment for wrongful confinement.—Whoever wrongfully confines any person shall be \npunished with imprisonment of either description for a term which may extend to one year, or with fine \nwhich may extend to one thousand rupees, or with both. \n343. Wrongful confinement for three or more days.—Whoever wrongfully confines any person for \nthree days, or more, shall be punished with imprisonment of either description for a term which may \nextend to two years, or with fine, or with both. \n344. Wrongful confinement for ten or more days.—Whoever wrongfully confines any person for \nten days, or more, shall be punished with imprisonment of either description for a term which may extend \nto three years, and shall also be liable to fine. \n345. Wrongful confinement of person for whose liberation writ has been issued.—Whoever \nkeeps any person in wrongful confinement, knowing that a writ for the liberation of that person has been \nduly issued, shall be punished with imprisonment of either description for a term which may extend to \ntwo years in addition to any term of imprisonment to which he may be liable under any other section of \nthis Chapter. \n346. Wrongful confinement in secret.—Whoever wrongfully confines any person in such manner as \nto indicate an intention that the confinement of such person may not be known to any person interested in \nthe person so confined, or to any public servant, or that the place of such confinement may not be known \nto or discovered by any such person or public servant as hereinbefore mentioned, shall be punished with \nimprisonment of either description for a term which may extend to two years in addition to any other \npunishment to which he may be liable for such wrongful confinement. \n347. Wrongful confinement to extort property, or constrain to illegal act.—Whoever wrongfully \nconfines any person for the purpose of extorting from the person confined, or from any person interested \nin the person confined, any property or valuable security or of constraining the person confined or any \nperson interested in such person to do anything illegal or to give any information which may facilitate the \ncommission of an offence, shall be punished with imprisonment of either description for a term which \nmay extend to three years, and shall also be liable to fine. \n348. Wrongful confinement to extort confession, or compel restoration of property.—Whoever \nwrongfully confines any person for the purpose of extorting from the person confined or any person \ninterested in the person confined any confession or any information which may lead to the detection of an \noffence or misconduct, or for the purpose of constraining the person confined or any person interested in \nthe person confined to restore or to cause the restoration of any property or valuable security or to satisfy \nany claim or demand, or to give information which may lead to the restoration of any property or valuable \nsecurity, shall be punished with imprisonment of either description for a term which may extend to three \nyears, and shall also be liable to fine. \nOf Criminal Force and Assault \n349. Force",
    "36": "Whoever \nkidnaps or abducts any person with intent to cause that person to be secretly and wrongfully confined, \nshall be punished with imprisonment of either description for a term which may extend to seven years, \nand shall also be liable to fine. \n366. Kidnapping, abducting or inducing woman to compel her marriage, etc.—Whoever kidnaps \nor abducts any woman with intent that she may be compelled, or knowing it to be likely that she will be \ncompelled, to marry any person against her will, or in order that she may be forced or seduced to illicit \nintercourse, or knowing it to be likely that she will be forced or seduced to illicit intercourse, shall be \npunished with imprisonment of either description for a term which may extend to ten years, and shall also \nbe liable to fine; 1[and whoever, by means of criminal intimidation as defined in this Code or of abuse of \nauthority or any other method of compulsion, induces any woman to go from any place with intent that \nshe may be, or knowing that it is likely that she will be, forced or seduced to illicit intercourse with \nanother person shall also be punishable as aforesaid]. \n2[366A. Procuration of minor girl",
    "37": "",
    "39": "When five or more persons conjointly commit or attempt to commit a robbery, or \nwhere the whole number of persons conjointly committing or attempting to commit a robbery, and \npersons present and aiding such commission or attempt, amount to five or more, every person so \ncommitting, attempting or aiding, is said to commit “dacoity”. \n392.  Punishment  for  robbery.—Whoever  commits  robbery  shall  be  punished  with  rigorous \nimprisonment for a term which may extend to ten years, and shall also be liable to fine; and, if the robbery \nbe committed on the highway between sunset and sunrise, the imprisonment may be extended to fourteen \nyears. \n393. Attempt to commit robbery.—Whoever attempts to commit robbery shall be punished with \nrigorous imprisonment for a term which may extend to seven years, and shall also be liable to fine. \n394.  Voluntarily  causing  hurt  in  committing  robbery.—If  any  person,  in  committing  or  in \nattempting  to  commit  robbery,  voluntarily  causes  hurt,  such  person,  and  any  other  person  jointly \nconcerned in committing or attempting to commit such robbery, shall be punished with 1[imprisonment \nfor life], or with rigorous imprisonment for a term which may extend to ten years, and shall also be liable \nto fine. \n395. Punishment for dacoity.—Whoever commits dacoity shall be punished with 1[imprisonment for \nlife], or with rigorous imprisonment for a term which may extend to ten years, and shall also be liable to \nfine. \n396. Dacoity with murder.—If any one of five or more persons, who are conjointly committing \ndacoity, commits murder in so committing dacoity, every one of those persons shall be punished with \ndeath, or 1[imprisonment for life], or rigorous imprisonment for a term which may extend to ten years, \nand shall also be liable to fine. \n397. Robbery, or dacoity, with attempt to cause death or grievous hurt.—If, at the time of \ncommitting robbery or dacoity, the offender uses any deadly weapon, or causes grievous hurt to any \nperson, or attempts to cause death or grievous hurt to any person, the imprisonment with which such \noffender shall be punished shall not be less than seven years. \n398. Attempt to commit robbery or dacoity when armed with deadly weapon",
    "40": "Whoever commits \nmischief, having made preparation for causing to any person death, or hurt, or wrongful restraint, or fear \nof death, or of hurt, or of wrongful restraint, shall be punished with imprisonment of either description for \na term which may extend to five years, and shall also be liable to fine. \nOf Criminal Trespass \n441. Criminal trespass",
    "41": "Whoever enters into or upon property in the possession of another with \nintent to commit an offence or to intimidate, insult or annoy any person in possession of such property,  \nor having lawfully entered into or upon such property, unlawfully remains there with intent thereby to \nintimidate, insult or annoy any such person, or with intent to commit an offence,  \nis said to commit “criminal trespass”. \n442. House-trespass",
    "43": "Whoever \ncommits mischief by destroying or moving any land-mark fixed by the authority of a public servant, or by \nany act which renders such land-mark less useful as such, shall be punished with imprisonment of either \ndescription for a term which may extend to one year, or with fine, or with both. \n435. Mischief by fire or explosive substance with intent to cause damage to amount of one \nhundred or (in case of agricultural produce) ten rupees.—Whoever commits mischief by fire or any \nexplosive substance intending to cause, or knowing it to be likely that he will thereby cause, damage to \nany property to the amount of one hundred rupees or upwards 1[or (where the property is agricultural \nproduce) ten rupees or upwards], shall be punished with imprisonment of either description for a term \nwhich may extend to seven years and shall also be liable to fine. \n436. Mischief by fire or explosive substance with intent to destroy house, etc.—Whoever commits \nmischief by fire or any explosive substance, intending to cause, or knowing it to be likely that he will \nthereby cause, the destruction of any building which is ordinarily used as a place of worship or as a \nhuman dwelling or as a place for the custody of property, shall be punished with 2[imprisonment for life], \nor with imprisonment of either description for a term which may extend to ten years, and shall also be \nliable to fine. \n437. Mischief with intent to destroy or make unsafe a decked vessel or one of twenty tons \nburden.—Whoever commits mischief to any decked vessel or any vessel of a burden of twenty tons or \nupwards, intending to destroy or render unsafe, or knowing it to be likely that he will thereby destroy or \nrender unsafe, that vessel, shall be punished with imprisonment of either description for a term which may \nextend to ten years, and shall also be liable to fine. \n438. Punishment for the mischief described in section 437 committed by fire or explosive \nsubstance. —Whoever commits, or attempts to commit, by fire or any explosive substance, such mischief \nas is described in the last preceding section, shall be punished with 2[imprisonment for life]. or with \nimprisonment of either description for a term which may extend to ten years, and shall also be liable to \nfine. \n439. Punishment for intentionally running vessel aground or ashore with intent to commit theft, \netc",
    "44": "",
    "45": "",
    "46": "",
    "9.": "",
    "50": "",
    "1.": "",
    "52": "Whoever fraudulently or with intent that fraud may be committed, is in possession of coin with \nrespect to which the offence defined in either of the section 246 or 248 has been committed, having \nknown at the time of becoming possessed thereof that such offence had been committed with respect to \nsuch coin, shall be punished with imprisonment of either description for a term which may extend to three \nyears, and shall also be liable to fine. \n253. Possession of Indian coin by person who knew it to be altered when he became possessed \nthereof",
    "53": "",
    "4[": "",
    "55": "Whoever counterfeits, or knowingly performs any part \nof the process of counterfeiting, any stamp issued by Government for the purpose of revenue shall be \npunished with 2[imprisonment for life] or with imprisonment of either description for a term which may \nextend to ten years, and shall also be liable to fine. \nExplanation.—A person commits this offence who counterfeits by causing a genuine stamps of one \ndenomination to appear like a genuine stamp of a different denomination. \n256. Having possession of instrument or material for counterfeiting Government stamp",
    "58": "",
    " c": "onsent of the offender, commute the punishment for imprisonment of either description for a term not \nexceeding fourteen years. \n1[55A.  Definition  of  “appropriate  Government”.—In  sections  fifty-four  and  fifty-five  the \nexpression “appropriate Government” means,— \n(a) in cases where the sentence is a sentence of death or is for an offence against any law relating \nto a matter to which the executive power of the Union extends, the Central Government; and \n(b) in cases where the sentence (whether of death or not) is for an offence against any law relating \nto a matter to which the executive power of the State extends, the Government of the State within \nwhich the offender is sentenced.] \n56. [Sentence of Europeans and Americans to penal servitude. Proviso as to sentence for term \nexceeding ten years but not for life.] Rep. by the Criminal Law (Removal of Racial Discriminations) Act, \n1949 (17 of 1949) (w. e. f. 6-4-1949). \n57.  Fractions  of  terms  of  punishment.—In  calculating  fractions  of  terms  of  punishment, \n2[imprisonment] for life shall be reckoned as equivalent to2[imprisonment] for twenty years. \n58. [Offenders sentenced to transportation how dealt with until transported.] Rep. by the Code of \nCriminal Procedure (Amendment) Act, 1955 (26 of 1955), s. 117 and the Sch. (w.e.f. 1-1-1956). \n59. [Transportation instead of imprisonment.] Rep. by s.117 and the Sch., ibid. (w.e.f. 1-1-1956). \n60. Sentence may be (in certain cases of imprisonment) wholly or partly rigorous or simple",
    "60": "",
    "61": "",
    "62": "",
    "63": "",
    "64": "Whoever kidnaps or abducts any person in \norder that such person may be murdered or may be so disposed of as to be put in danger of being \nmurdered, shall be punished with 3[imprisonment for life] or rigorous imprisonment for a term which may \nextend to ten years, and shall also be liable to fine. \nIIIustrations \n(a) A kidnaps Z from 1[India], intending or knowing it to be likely that Z may be sacrificed to an idol. A has committed the \noffence defined in this section. \n(b) A forcibly carries or entices B away from his home in order that B may be murdered. A has committed the offence \ndefined in this section. \n4[364A. Kidnapping for ransom, etc",
    "67": "1[Whoever has in his possession any document or electronic record, \nknowing the same to be forged and intending that the same shall fraudulently or dishonestly be used as \ngenuine, shall, if the document or electronic record is one of the description mentioned in section 466 of \nthis Code], be punished with imprisonment of either description for a term which may extend to seven \nyears, and shall also be liable to fine; and if the document is one of the description mentioned in section \n467, shall be punished with 2[imprisonment for life], or with imprisonment of either description, for a \nterm which may extend to seven years, and shall also be liable to fine. \n475. Counterfeiting device or mark used for authenticating documents described in section 467, \nor possessing counterfeit marked material.—Whoever counterfeits upon, or in the substance of, any \nmaterial, any device or mark used for the purpose of authenticating any document described in section \n467 of this Code, intending that such device or mark shall be used for the purpose of giving the \nappearance of authenticity to any document then forged or thereafter to be forged on such material, or \nwho, with such intent, has in his possession any material upon or in the substance of which any such \ndevice  or  mark  has  been  counterfeited,  shall  be  punished  with  2[imprisonment  for  life],  or  with \nimprisonment of either description for a term which may extend to seven years, and shall also be liable to \nfine. \n476.  Counterfeiting  device  or  mark  used  for  authenticating  documents  other  than  those \ndescribed in section 467, or possessing counterfeit marked material.—Whoever counterfeits upon, or \nin the substance of, any material, any device or mark used for the purpose of authenticating  3[any \ndocument or electronic record] other than the documents described in section 467 of this Code, intending \nthat such device or mark shall be used for the purpose of giving the appearance of authenticity to any \ndocument then forged or thereafter to be forged on such material, or who with such intent, has in his \npossession  any  material  upon  or  in  the  substance  of  which  any  such  device  or  mark  has  been \ncounterfeited, shall be punished with imprisonment of either description for a term which may extend to \nseven years, and shall also be liable to fine. \n477.  Fraudulent  cancellation,  destruction,  etc.,  of  will,  authority  to  adopt,  or  valuable \nsecurity",
    "68": "Whoever commits forgery, intending that the 3[document or \nelectronic record forged] shall be used for the purpose of cheating, shall be punished with imprisonment \nof either description for a term which may extend to seven years, and shall also be liable to fine. \n469. Forgery for purpose of harming reputation",
    "69": "Whoever commits forgery, 3[intending that the \ndocument or electronic record forged] shall harm the reputation of any party, or knowing that it is likely \nto be used for that purpose, shall be punished with imprisonment of either description for a term which \nmay extend to three years, and shall also be liable to fine. \n470. Forged document",
    "71": "",
    "73": "Whenever any person is convicted of an offence for which under this \nCode the Court has power to sentence him to rigorous imprisonment, the Court may, by its sentence, \norder  that  the  offender  shall  be  kept  in  solitary  confinement  for  any  portion  or  portions  of  the \nimprisonment to which he is sentenced, not exceeding three months in the whole, according to the \nfollowing scale, that is to say— \na time not exceeding one month if the term of imprisonment shall not exceed six months; \na time not exceeding two months if the term of imprisonment shall exceed six months and1[shall not \nexceed one] year \na time not exceeding three months if the term of imprisonment shall exceed one year. \n74.  Limit  of  solitary  confinement",
    "74": "Whoever unlawfully compels any person to labour against the \nwill of that person, shall be punished with imprisonment of either description for a term which may \nextend to one year, or with fine, or with both. \n4[Sexual offences \n5[375. Rape",
    "76": "",
    "79": "A mark used for denoting that movable property belongs to a particular \nperson is called a property mark. \n480. [Using a false trade mark.] Rep. by the Trade and Merchandise Marks Act, 1958 (43 of 1958), s. \n135and Sch. (w.e.f. 25- 11-1959). \n481. Using a false property mark",
    "80": "",
    "81": "Whoever exhibits any false light, mark or buoy, \nintending or knowing it to be likely that such exhibition will mislead any navigator, shall be punished \nwith imprisonment of either description for a term which may extend to seven years, or with fine, or with \nboth.  \n282. Conveying person by water for hire in unsafe or overloaded vessel",
    "83": "",
    "85": "Whoever \nmakes or has in his possession any die, plate or other instrument for the purpose of counterfeiting a \nproperty mark, or has in his possession a property mark for the purpose of denoting that any goods belong \nto a person to whom they do not belong, shall be punished with imprisonment of either description for a \nterm which may extend to three years, or with fine, or with both.] \n486. Selling goods marked with a counterfeit property mark",
    "87": "Nothing which is not intended to cause death, or grievous hurt, and which is not known by the \ndoer to be likely to cause death or grievous hurt, is an offence by reason of any harm which it may cause, \nor be intended by the doer to cause, to any person, above eighteen years of age, who has given consent, \nwhether express or implied, to suffer that harm; or by reason of any harm which it may be known by the \ndoer to be likely to cause to any such person who has consented to take the risk of that harm. \nIllustration \nA and Z agree to fence with each other for amusement. This agreement implies the consent of each to suffer any harm \nwhich, in the course of such fencing, may be caused without foul play; and if A, while playing fairly, hurts Z, A commits no \noffence. \n88. Act not intended to cause death, done by consent in good faith for person's benefit",
    "89": "",
    "90": "",
    "92": "",
    "95": "",
    "99": "His own body, and the body of any other person, against any offence affecting the human \nbody; \nSecondly.—The property, whether movable or immovable, of himself or of any other person, against \nany act which is an offence falling under the defintion of theft, robbery, mischief or criminal trespass, or \nwhich is an attempt to commit theft, robbery, mischief or criminal trespass. \n98. Right of private defence against the act of a person of unsound mind, etc.—When an act, \nwhich would otherwise be a certain offence, is not that offence, by reason of the youth, the want of \nmaturity of understanding, the unsoundness of mind or the intoxication of the person doing that act, or by \nreason of any misconception on the part of that person, every person has the same right of private defence \nagainst that act which he would have if the act were that offence. \nIllustrations \n(a) Z, under the influence of madness, attempts to kill A; Z is guilty of no offence. But A has the same right of private \ndefence which he would have if Z were sane. \n(b) A enters by night a house which he is legally entitled to enter. Z, in good faith, taking A for a house-breaker, attacks A. \nHere Z, by attacking A under this misconception, commits no offence. But A has the same right of private defence against Z, \nwhich he would have if Z were not acting under that misconception. \n99. Acts against which there is no right of private defence.—There is no right of private defence \nagainst an act which does not reasonably cause the apprehension of death or of grievous hurt, if done, or \nattempted to be done, by a public servant acting in good faith under colour of his office, though that act, \nmay not be strictly justifiable by law. \nThere is no right of private defence against an act which does not reasonably cause the apprehension \nof death or of grievous hurt, if done, or attempted to be done, by the direction of a public servant acting in \ngood faith under colour of his office, though that direction may not be strictly justifiable by law. \nThere is no right of private defence in cases in which there is time to have recourse to protection of \nthe public authorities. \nExtent to which the right may be exercised.—The right of private defence in no case extends to the \ninflicting of more harm than it is necessary to inflict for the purpose of defence. \nExplanation 1.—A person is not deprived of the right of private defence against an act done, or \nattempted to be done, by a public servant, as such, unless he knows or has reason to believe, that the \nperson doing the act is such public servant. \nExplanation 2.—A person is not deprived of the right of private defence against an act done, or \nattempted to be done, by the direction of a public servant, unless he knows, or has reason to believe, that \nthe person doing the act is acting by such direction, or unless such person states the authority under which \nhe acts, or if he has authority in writing, unless he produces such authority, if demanded. \n100. When the right of private defence of the body extends to causing death",
    "10": "",
    "02": "",
    "04": "",
    "07": "A person abets the doing of a thing, who— \nFirst.—Instigates any person to do that thing; or \nSecondly.—Engages with one or more other person or persons in any conspiracy for the doing of that \nthing, if an act or illegal omission takes place in pursuance of that conspiracy, and in order to the doing of \nthat thing; or \nThirdly.—Intentionally aids, by any act or illegal omission, the doing of that thing. \nExplanation 1.—A person who, by wilful misrepresentation, or by wilful concealment of a material \nfact which he is bound to disclose, voluntarily causes or procures, or attempts to cause or procure, a thing \nto be done, is said to instigate the doing of that thing. \nIllustration \nA, a public officer, is authorised by a warrant from a Court of Justice to apprehend Z, B, knowing that fact and also that C is \nnot Z, wilfully represents to A that C is Z, and thereby intentionally causes A to apprehend C. Here B abets by instigation the \napprehension of C. \nExplanation 2.—Whoever, either prior to or at the time of the commission of an act, does anything in \norder to facilitate the commission of that act, and thereby facilitates the commission thereof, is said to aid \nthe doing of that act. \n108. Abettor",
    "8A": "A person abets an offence within the \nmeaning of this Code who, in 2[India], abets the commission of any act without and beyond 2[India] \nwhich would constitute an offence if committed in 2[India]. \nIllustration \nA, in 2[India], instigates B, a foreigner in Goa, to commit a murder in Goa, A is guilty of abetting murder.] \n109. Punishment of abetment if the act abetted is committed in consequence and where no \nexpress provision is made for its punishment",
    "20": "",
    "12": "\nWhoever commits depredation, or makes preparations to commit depredation, on the territories of any \nPower in alliance or at peace with the 1[Government of India], shall be punished with imprisonment of \neither description for a term which may extend to seven years, and shall also be liable to fine and to \nforfeiture of any property used or intended to be used in committing such depredation, or acquired by \nsuch depredation. \n127. Receiving property taken by war or depredation mentioned in sections 125 and 126.—\nWhoever receives any property knowing the same to have been taken in the commission of any of the \noffences mentioned in sections 125 and 126, shall be punished with imprisonment of either description \nfor a term which may extend to seven years, and shall also be liable to fine and to forfeiture of the \nproperty so received. \n128. Public servant voluntarily allowing prisoner of state or war to escape.—Whoever, being a \npublic servant and having the custody of any State prisoner or prisoner of war, voluntarily allows such \nprisoner  to  escape  from  any  place  in  which  such  prisoner  is  confined,  shall  be  punished  with \n2[imprisonment for life], or imprisonment of either description for a term which may extend to ten years, \nand shall also be liable to fine. \n129. Public servant negligently suffering such prisoner to escape",
    "0B": "(1) Whoever is a party to a criminal conspiracy to \ncommit an offence punishable with death, 1[imprisonment for life] or rigorous imprisonment for a term of \ntwo years or upwards, shall, where no express provision is made in this Code for the punishment of such a \nconspiracy, be punished in the same manner as if he had abetted such offence. \n(2) Whoever is a party to a criminal conspiracy other than a criminal conspiracy to commit an offence \npunishable  as  aforesaid  shall  be  punished  with  imprisonment  of  either  description  for  a  term  not \nexceeding six months, or with fine or with both.] \nCHAPTER VI \nOF OFFENCES AGAINSTTHE STATE \n121. Waging, or attempting to wage war, or abetting waging of war, against the Government of \nIndia",
    "21": "",
    "4A": "",
    "5 ": "",
    " 1": "26. Committing depredation on territories of Power at peace with the Government of India.—\nWhoever commits depredation, or makes preparations to commit depredation, on the territories of any \nPower in alliance or at peace with the 1[Government of India], shall be punished with imprisonment of \neither description for a term which may extend to seven years, and shall also be liable to fine and to \nforfeiture of any property used or intended to be used in committing such depredation, or acquired by \nsuch depredation. \n127. Receiving property taken by war or depredation mentioned in sections 125 and 126.—\nWhoever receives any property knowing the same to have been taken in the commission of any of the \noffences mentioned in sections 125 and 126, shall be punished with imprisonment of either description \nfor a term which may extend to seven years, and shall also be liable to fine and to forfeiture of the \nproperty so received. \n128. Public servant voluntarily allowing prisoner of state or war to escape",
    "28": "",
    "30": "",
    "13": "",
    "38": "",
    "14": "Whoever voluntarily assists in concealing or \ndisposing of or making away with property which he knows or has reason to believe to be stolen property, \nshall be punished with imprisonment of either description for a term which may extend to three years, or \nwith fine, or with both. \nOf Cheating \n415. Cheating",
    "42": "Whoever commits mischief shall be punished with imprisonment of \neither description for a term which may extend to three months, or with fine, or with both. \n427. Mischief causing damage to the amount of fifty rupees.—Whoever commits mischief and \nthereby  causes  loss  or  damage  to  the  amount  of  fifty  rupees  or  upwards,  shall  be  punished  with \nimprisonment of either description for a term which may extend to two years, or with fine, or with both.  \n428. Mischief by killing or maiming animal of the value of ten rupees",
    "47": "",
    "15": "",
    "16": "",
    "65": "",
    "66": "3[Whoever forges a document or an \nelectronic record], purporting to be a record or proceeding of or in a Court of Justice, or a register of birth, \nbaptism, marriage or burial, or a register kept by a public servant as such, or a certificate or document \npurporting to be made by a public servant in his official capacity, or an authority to institute or defend a \nsuit, or to take any proceedings therein, or to confess judgment, or a power of attorney, shall be punished \nwith imprisonment of either description for a term which may extend to seven years, and shall also be \nliable to fine. \n1[Explanation",
    "6B": "",
    "1A": "",
    "1B": "",
    "1E": "",
    "1F": "",
    "1G": "",
    "1H": "",
    "72": "",
    "2 ": "",
    "78": "",
    "84": "Whoever does, with any poisonous \nsubstance, any act in a manner so rash or negligent as to endanger human life, or to be likely to cause hurt \nor injury to any person, \nor knowingly or negligently omits to take such order with any poisonous substance in his possession \nas is sufficient to guard against any probable danger to human life from such poisonous substance, \nshall be punished with imprisonment of either description for a term which may extend to six months, \nor with fine which may extend to one thousand rupees, or with both. \n285. Negligent conduct with respect to fire or combustible matter",
    "86": "",
    "93": "Whoever intentionally gives false evidence in any of a \njudicial proceeding, or fabricates false evidence for the purpose of being used in any stage of a judicial \nproceeding, shall be punished with imprisonment of either description for a term which may extend to \nseven years, and shall also be liable to fine; \nand whoever intentionally gives or fabricates false evidence in any other case, shall be punished with \nimprisonment of either description for a term which may extend to three years, and shall also be liable to \nfine. \nExplanation 1.—A trial before a Court-martial2***is a judicial proceeding. \nExplanation 2.—An investigation directed by law preliminary to a proceeding before a Court of \nJustice, is a stage of a judicial proceeding, though that investigation may not take place before a Court of \nJustice. \nIllustration \nA, in an enquiry before a Magistrate for the purpose of ascertaining whether Z ought to be committed for trial, makes on \noath a statement which he knows to be false. As this enquiry is a stage of a judicial proceeding, A as given false evidence. \nExplanation 3.—An investigation directed by a Court of Justice according to law, and conducted \nunder the authority of a Court of Justice, is a stage of a judicial proceeding, though that investigation may \nnot take place before a Court of Justice. \nIllustration \nA, in an enquiry before an officer deputed by a Court of Justice to ascertain on the spot the boundaries of land, makes on \noath a statement which he knows to be false. As this enquiry is a stage of a judicial proceeding, A has given false evidence. \n194. Giving or fabricating false evidence with intent to procure conviction of capital offence",
    "97": "Whoever, with the intention of wounding the feelings of \nany person, or of insulting the religion of any person or with the knowledge that the feelings of any \nperson are likely to be wounded, or that the religion of any person is likely to be insulted thereby, \ncommits any trespass in any place of worship or on any place of sepulture, or any place set apart for \nthe performance of funeral rites or as a depository for the remains of the dead, or offers any indignity to \nany human corpse, or causes disturbance to any persons assembled for the performance of funeral \nceremonies, \nshall be punished with imprisonment of either description for a term which may extend to one year, or \nwith fine, or with both.  \n298. Uttering words, etc., with deliberate intent to wound religious feelings",
    "00": "",
    "05": "Whoever falsely \npersonates another, and in such assumed character makes any admission or statement, or confesses \njudgment, or causes any process to be issued or becomes bail or security, or does any other act in any suit \nor criminal prosecution, shall be punished with imprisonment of either description for a term which may \nextend to three years, or with fine, or with both. \n206. Fraudulent removal or concealment of property to prevent its seizure as forfeited or in \nexecution",
    "08": "",
    "09": "Whoever, intending to \ninsult the modesty of any woman, utters any words, makes any sound or gesture, or exhibits any object, \nintending that such word or sound shall be heard, or that such gesture or object shall be seen, by such \nwoman, or intrudes upon the privacy of such woman, 1[shall be punished with simple imprisonment for a \nterm which may extend to three years, and also with fine]. \n510. Misconduct in public by a drunken person",
    "5B": "Whoever, in any case not provided for in section 224 or section 225 or in any \nother law for the time being in force, intentionally offers any resistance or illegal obstruction to the lawful \napprehension of himself or of any other person, or escapes or attempts to escape from any custody in \nwhich he is lawfully detained, or rescues or attempts to rescue any other person from any custody in \nwhich that person is lawfully detained, shall be punished with imprisonment of either description for a \nterm which may extend to six months, or with fine, or with both.] \n226. [Unlawful return from transportation.] Rep. by the Code of Criminal Procedure (Amendment) \nAct, 1955 (26 of 1955), s. 117 and the Sch (w.e.f. 1-1-1956). \n227.  Violation  of  condition  of  remission  of  punishment",
    "26": "",
    "3[": "For the purposes of this section, \"register\" includes any list, data or record of any \nentries maintained in the electronic form as defined in clause (r) of sub section (1) of section 2 of the \nInformation Technology Act, 2000 (21 of 2000).] \n467. Forgery of valuable security, will, etc",
    "23": "",
    "24": "",
    "27": "Whoever sells, or offers or exposes for sale, as food or drink, \nany article which has been rendered or has become noxious, or is in a state unfit for food or drink, \nknowing or having reason to believe that the same is noxious as food or drink, shall be punished with \nimprisonment of either description for a term which may extend to six months, or with fine which may \nextend to one thousand rupees, or with both. \n274. Adulteration of drugs.—Whoever adulterates any drug or medical preparation in such a manner \nas to lessen the efficacy or change the operation of such drug or medical preparation, or to make it \nnoxious, intending that it shall be sold or used for, or knowing it to be likely that it will be sold or used \nfor,  any  medicinal  purpose,  as  if  it  had  not  undergone  such  adulteration,  shall  be  punished  with \nimprisonment of either description for a term which may extend to six months, or with fine which may \nextend to one thousand rupees, or with both. \n275. Sale of adulterated drugs.—Whoever, knowing any drug or medical preparation to have been \nadulterated in such a manner as to lessen its efficacy, to change its operation, or to render it noxious, sells \nthe same, or offers or exposes it for sale, or issues it from any dispensary for medicinal purposes as \nunadulterated,  or  causes  it  to  be  used  for  medicinal  purposes  by  any  person  not  knowing  of  the \nadulteration, shall be punished with imprisonment of either description for a term which may extend to \nsix months, or with fine which may extend to one thousand rupees, or with both. \n276. Sale of drug as a different drug or preparation.—Whoever knowingly sells, or offers or \nexposes for sale, or issues from a dispensary for medicinal purposes, any drug or medical preparation, as a \ndifferent drug or medical preparation, shall be punished with imprisonment of either description for a \nterm which may extend to six months, or with fine which may extend to one thousand rupees, or with \nboth. \n277. Fouling water of public spring or reservoir.—Whoever voluntarily corrupts or fouls the water \nof any public spring or reservoir, so as to render it less fit for the purpose for which it is ordinarily used, \nshall be punished with imprisonment of either description for a term which may extend to three months, \nor with fine which may extend to five hundred rupees, or with both. \n278. Making atmosphere noxious to health.—Whoever voluntarily vitiates the atmosphere in any \nplace so as to make it noxious to the health of persons in general dwelling or carrying on business in the \nneighbourhood or passing along a public way, shall be punished with fine which may extend to five \nhundred rupees. \n279. Rash driving or riding on a public way",
    "94": "Whoever, to the annoyance of others, \n(a) does any obscene act in any public place, or \n(b) sings, recites or utters any obscene song, ballad or words, in or near any public place, \nshall be punished with imprisonment of either description for a term which may extend to three months, \nor with fine, or with both.] \n2[294A. Keeping lottery office.—Whoever keeps any office or place for the purpose of drawing any \nlottery 3[not being 4[a State lottery] or a lottery authorised by the 5[State] Government], shall be punished \npunished with imprisonment of either description for a term which may extend to six months, or with \nfine, or with both. \nAnd whoever publishes any proposal to pay any sum, or to deliver any goods, or to do or forbear \ndoing anything for the benefit of any person, on any event or contingency relative or applicable to the \ndrawing of any ticket, lot, number or figure in any such lottery, shall be punished with fine which may \nextend to one thousand rupees.] \nCHAPTER XV \nOF OFFENCESRELATING TO RELIGION \n295. Injuring or defiling place of worship, with intent to insult the religion of any class",
    "6[": "",
    "5A": "Whoever,  with  deliberate  and  malicious  intention  of \noutraging the religious feelings of any class of 7[citizens of India], 8[by words, either spoken or written, or \nor by signs or by visible representations or otherwise], insults or attempts to insult the religion or the \nreligious beliefs of that class, shall be punished with imprisonment of either description for a term which \nmay extend to 9[three years], or with fine, or with both.] \n296. Disturbing religious assembly",
    "96": "Whoever voluntarily causes disturbance to any assembly \nlawfully engaged in the performance of religious worship, or religious ceremonies, shall be punished with \nimprisonment of either description for a term which may extend to one year, or with fine, or with both. \n297. Trespassing on burial places, etc",
    "03": "Whoever, being under sentence of 1[imprisonment \nfor life], commits murder, shall be punished with death. \n304. Punishment for culpable homicide not amounting to murder",
    " A": "ttempts by life-convicts.—1[When any person offending under this section is under sentence of \n1[imprisonment for life], he may, if hurt is caused, be punished with death.] \nIllustrations \n(a) A shoots at Z with intention to kill him, under such circumstances that, if death ensued A would be guilty of murder. A is \nliable to punishment under this section. \n(b) A, with the intention of causing the death of a child of tender years, exposes it in a desert place A has committed the \noffence defined by this section, though the death of the child does not ensue. \n(c) A, intending to murder Z, buys a gun and loads it. A has not yet committed the offence. A fires the gun at Z. He has \ncommitted the offence defined in this section, and, if by such firing he wounds Z, he is liable to the punishment provided by the  \n latter part of 2[the first paragraph of] this section. \n(d) A, intending to murder Z by poison, purchases poison and mixes the same with food which remains in A's keeping; A \nhas not yet committed the offence defined in this section. A places the food on Z's table or delivers it to Z's servants to place it on \nZ's table. A has committed the offence defined in this section. \n 308.  Attempt  to  commit  culpable  homicide",
    "33": "Whoever voluntarily causes \nhurt to any person being a public servant in the discharge of his duty as such public servant, or with intent \nto prevent or deter that person or any other public servant from discharging his duty as such public \nservant or in consequence of anything done or attempted to be done by that person in the lawful discharge \nof his duty as such public servant, shall be punished with imprisonment of either description for a term \nwhich may extend to three years, or with fine, or with both. \n333.  Voluntarily  causing  grievous  hurt  to  deter  public  servant  from  his  duty.—Whoever \nvoluntarily causes grievous hurt to any person being a public servant in the discharge of his duty as such \npublic servant, or with intent to prevent or deter that person or any other public servant from discharging \nhis duty as such public servant, or in consequence of anything done or attempted to be done by that \nperson in the lawful discharge of his duty as such public servant, shall be punished with imprisonment of \neither description for a term which may extend to ten years, and shall also be liable to fine. \n334. Voluntarily causing hurt on provocation.—Whoever voluntarily causes hurt on grave and \nsudden provocation, if he neither intends nor knows himself to be likely to cause hurt to any person other \nthan the person who gave the provocation, shall be punished with imprisonment of either description for a \nterm which may extend to one month, or with fine which may extend to five hundred rupees, or with both. \n335. Voluntarily causing grievous hurt on provocation.—Whoever 1[voluntarily] causes grievous \nhurt on grave and sudden provocation, if he neither intends nor knows himself to be likely to cause \ngrievous hurt to any person other than the person who gave the provocation, shall be punished with \nimprisonment of either description for a term which may extend to four years, or with fine which may \nextend to two thousand rupees, or with both.  \nExplanation.—The last two sections are subject to the same provisos as Exception 1, section 300. \n336. Act endangering life or personal safety of others.—Whoever does any act so rashly or \nnegligently  as  to  endanger  human  life  or  the  personal  safety  of  others,  shall  be  punished  with \nimprisonment of either description for a term which may extend to three months or with fine which may \nextend to two hundred and fifty rupees, or with both. \n337. Causing hurt by act endangering life or personal safety of others.—Whoever causes hurt to \nany person by doing any act so rashly or negligently as to endanger human life, or the personal safety of \nothers, shall be punished with imprisonment of either description for a term which may extend to six \nmonths, or with fine which may extend to five hundred rupees, or with both. \n338. Causing grievous hurt by act endangering life or personal safety of others.—Whoever \ncauses grievous hurt to any person by doing any act so rashly or negligently as to endanger human life, or \nthe personal safety of others, shall be punished with imprisonment of either description for a term which \nmay extend to two years, or with fine which may extend to one thousand rupees, or with both. \nOf wrongful restraint and wrongful confinement \n339. Wrongful restraint",
    "48": "Whoever makes any false \nmark upon any case, package or other receptacle containing goods, in a manner reasonably calculated to \ncause any public servant or any other person to believe that such receptacle contains goods which it does \nnot contain or that it does not contain goods which it does contain, or that the goods contained in such \nreceptacle are of a nature or quality different from the real nature or quality thereof, shall, unless he \nproves that he acted without intent to defraud, be punished with imprisonment of either description for a \nterm which may extend to three years, or with fine, or with both. \n488. Punishment for making use of any such false mark.—Whoever makes use of any such false \nmark in any manner prohibited by the last foregoing section shall, unless he proves that he acted without \nintent to defraud, be punished as if he had committed an offence against that section. \n489. Tampering with property mark with intent to cause injury.—Whoever removes, destroys, \ndefaces or adds to any property mark, intending or knowing it to be likely that he may thereby cause \ninjury to any person, shall be punished with imprisonment of either description for a term which may \nextend to one year, or with fine, or with both.] \n1[Of Currency-Notes and Bank-Notes \n489A.  Counterfeiting  currency-notes  or  bank-notes.—Whoever  counterfeits,  or  knowingly \nperforms any part of the process of counterfeiting, any currency-note or bank-note, shall be punished with \n2[imprisonment for life], or with imprisonment of either description for a term which may extend to ten \nyears, and shall also be liable to fine. \nExplanation.—For the purposes of this section and of sections 489B, 3[489C, 489D and 489E], the \nexpression “bank-note” means a promissory note or engagement for the payment of money to bearer on \ndemand issued by any person carrying on the business of banking in any part of the world, or issued by or \nunder the authority of any State or Sovereign Power, and intended to be used as equivalent to, or as a \nsubstitute for money. \n489B. Using as genuine, forged or counterfeit currency-notes or bank-notes",
    "35": "(1) Any man who— \n(i)  follows  a  woman  and  contacts,  or  attempts  to  contact  such  woman  to  foster  personal \ninteraction repeatedly despite a clear indication of disinterest by such woman; or \n(ii)  monitors  the  use  by  a  woman  of  the  internet,  email  or  any  other  form  of  electronic \ncommunication, \ncommits the offence of stalking: \nProvided that such conduct shall not amount to stalking if the man who pursued it proves that— \n(i) it was pursued for the purpose of preventing or detecting crime and the man accused of \nstalking had been entrusted with the responsibility of prevention and detection of crime by the \nState; or \n(ii) it was pursued under any law or to comply with any condition or requirement imposed by \nany person under any law; or \n(iii) in the particular circumstances such conduct was reasonable and justified. \n(2) Whoever commits the offence of stalking shall be punished on first conviction with imprisonment \nof either description for a term which may extend to three years, and shall also be liable to fine; and be \npunished on a second or subsequent conviction, with imprisonment of either description for a term which \nmay extend to five years, and shall also be liable to fine.] \n355.  Assault  or  criminal  force  with  intent  to  dishonour  person,  otherwise  than  on  grave \nprovocation. —Whoever assaults or uses criminal force to any person, intending thereby to dishonour \nthat person, otherwise than on grave and sudden provocation given by that person, shall be punished with \nimprisonment of either description for a term which may extend to two years, or with fine, or with both.  \n356. Assault or criminal force in attempt to commit theft of property carried by a person.—\nWhoever assaults or uses criminal force to any person, in attempting to commit theft on any property \nwhich that person is then wearing or carrying, shall be punished with imprisonment of either description \nfor a term which may extend to two years, or with fine, or with both. \n357. Assault or criminal force in attempt wrongfully to confine a person.—Whoever assaults or \nuses criminal force to any person, in attempting wrongfully to confine that person, shall be punished with \nimprisonment of either description for a term which may extend to one year, or with fine which may \nextend to one thousand rupees, or with both. \n358. Assault or criminal force on grave provocation",
    "51": "",
    "54": "",
    "4B": "",
    "4D": "",
    "56": "",
    "59": "Kidnapping is of two kinds: kidnapping from 1[India], and kidnapping from \nlawful guardianship. \n360. Kidnapping from India",
    "2[": "",
    "3A": "(1) Whoever kidnaps any \nminor or, not being the lawful guardian of a minor, obtains the custody of the minor, in order that such \nminor may be employed or used for the purposes of begging shall be punishable with imprisonment of \neither description for a term which may extend to ten years, and shall also be liable to fine. \n(2) Whoever maims any minor in order that such minor may be employed or used for the purposes of \nbegging shall be punishable with imprisonment for life, and shall also be liable to fine. \n(3) Where any person, not being the lawful guardian of a minor, employs or uses such minor for the \npurposes of begging, it shall be presumed, unless the contrary is proved, that he kidnapped or otherwise \nobtained the custody of that minor in order that the minor might be employed or used for the purposes of \nbegging. \n(4) In this section,— \n(a) “begging” means— \n(i) soliciting or receiving alms in a public place, whether under the pretence of singing, \ndancing, fortunetelling, performing tricks or selling articles or otherwise; \n(ii) entering on any private premises for the purpose of soliciting or receiving alms; \n(iii) exposing or exhibiting, with the object of obtaining or extorting alms, any sore, wound, \ninjury, deformity or disease, whether of himself or of any other person or of an animal; \n(iv) using a minor as an exhibit for the purpose of soliciting or receiving alms; \n(b) “minor” means— \n(i) in the case of a male, a person under sixteen years of age; and \n(ii) in the case of a female, a person under eighteen years of age.]  \n364. Kidnapping or abducting in order to murder",
    "6A": "",
    "0A": "",
    "5[": "",
    "6C": "",
    "6D": "",
    "6E": "Whoever has been previously convicted of an offence \npunishable under section 376 or section 376A or 1[section 376AB or section 376D or section 376DA or \nsection 376DB,]  and is subsequently convicted of an offence punishable under any of the said sections \nshall be punished with imprisonment for life which shall mean imprisonment for the remainder of that \nperson's natural life, or with death.]] \nOf Unnatural Offences \n377. Unnatural offences",
    "77": "",
    "57": "",
    "70": "A false 5[document or electronic record] made wholly or in part by forgery \nis designated “a forged 5[document or electronic record]”. \n471.  Using  as  genuine  a  forged  document  or  electronic  record",
    "6 ": "",
    "75": "",
    "88": "",
    "9B": "",
    "9C": "",
    "9D": "",
    "49": "Whoever has sexual intercourse with a person who is and whom he knows or has \nreason to believe to be the wife of another man, without the consent or connivance of that man, such \nsexual intercourse not amounting to the offence of rape, is guilty of the offence of adultery, and shall be \npunished with imprisonment of either description for a term which may extend to five years, or with fine, \nor with both. In such case the wife shall not be punishable as an abettor. \n498. Enticing or taking away or detaining with criminal intent a married woman.—Whoever \ntakes or entices away any woman who is and whom he knows or has reason to believe to be the wife of \nany other man, from that man, or from any person having the care of her on behalf of that man, with \nintent that she may have illicit intercourse with any person, or conceals or detains with that intent any \nsuch woman, shall be punished with imprisonment of either description for a term which may extend to \ntwo years, or with fine, or with both. \n1[CHAPTER XXA \nOF CRUELTY BY HUSBANDOR RELATIVESOF HUSBAND \n498A. Husband or relative of husband of a woman subjecting her to cruelty.—Whoever, being \nthe husband or the relative of the husband of a woman, subjects such woman to cruelty shall be punished \nwith imprisonment for a term which may extend to three years and shall also be liable to fine. \nExplanation.—For the purposes of this section, “cruelty” means— \n(a) anywilful conduct which is of such a nature as is likely to drive the woman to commit suicide \nor to cause grave injury or danger to life, limb or health (whether mental or physical) of the woman; \nor \n(b) harassment of the woman where such harassment is with a view to coercing her or any person \nrelated to her to meet any unlawful demand for any property or valuable security or is on account of \nfailure by her or any person related to her to meet such demand.] \nCHAPTER XXI \nOF DEFAMATION \n499. Defamation",
    "91": "",
    "98": ""
}